[["BONASERA","I believe in America. America has made my fortune. And I raised my daughter in the American fashion. I gave her freedom, but -- I taught her never to dishonor her family. She found a boyfriend; not an Italian. She went to the movies with him; she stayed out late. I didn't protest. Two months ago, he took her for a drive, with another boyfriend. They made her drink whiskey. And then they tried to take advantage of her. She resisted. She kept her honor. So they beat her, like an animal. When I went to the hospital, her nose was a'broken. Her jaw was a'shattered, held together by wire. She couldn't even weep because of the pain. But I wept. Why did I weep? She was the light of my life -- beautiful girl. Now she will never be beautiful again.  Sorry...  I -- I went to the police, like a good American. These two boys were brought to trial. The judge sentenced them to three years in prison -- suspended sentence. Suspended sentence! They went free that very day! I stood in the courtroom like a fool. And those two bastard, they smiled at me. Then I said to my wife, \"for justice, we must go to Don Corleone.\""],["VITO","Why did you go to the police? Why didn't you come to me first?"],["BONASERA","What do you want of me? Tell me anything. But do what I beg you to do."],["VITO","What is that?  That I cannot do."],["BONASERA","I'll give you anything you ask."],["VITO","We've known each other many years, but this is the first time you came to me for counsel, for help. I can't remember the last time that you invited me to your house for a cup of coffee, even though my wife is godmother to your only child. But let's be frank here: you never wanted my friendship. And uh, you were afraid to be in my debt."],["BONASERA","I didn't want to get into trouble."],["VITO","I understand. You found paradise in America, had a good trade, made a good living. The police protected you; and there were courts of law. And you didn't need a friend of me. But uh, now you come to me and you say -- \"Don Corleone give me justice.\" -- But you don't ask with respect. You don't offer friendship. You don't even think to call me Godfather. Instead, you come into my house on the day my daughter is to be married, and you uh ask me to do murder, for money."],["BONASERA","I ask you for justice."],["VITO","That is not justice; your daughter is still alive."],["BONASERA","Then they can suffer then, as she suffers.  How much shall I pay you?"],["VITO","Bonasera... Bonasera... What have I ever done to make you treat me so disrespectfully? Had you come to me in friendship, then this scum that ruined your daughter would be suffering this very day. And that by chance if an honest man such as yourself should make enemies, then they would become my enemies. And then they would fear you."],["BONASERA","Be my friend --  -- Godfather?"],["VITO","Good.  Some day, and that day may never come, I'll call upon you to do a service for me. But uh, until that day -- accept this justice as a gift on my daughter's wedding day."],["BONASERA","Grazie, Godfather."],["VITO","Prego.  Ah, give this to ah, Clemenza. I want reliable people; people that aren't gonna be carried away. I'm mean, we're not murderers, despite of what this undertaker says."],["CUT TO:","Connie's Wedding reception. We hear the music \"Connie's Wedding \" -day"],["CUT TO:","Connie and Carlo at the head table"],["CUT TO:","The family gathers for a family portrait"],["VITO","Where's Michael?"],["SONNY","Don't worry; it's early."],["VITO","We're not taking the picture without Michael"],["TOM","What's the matter, Sonny?"],["SONNY","It's Michael"],["CUT TO:","The Don meeting some guests outside"],["CUT TO:","Mama dancing with Sonny's twin girls"],["CUT TO:","Connie and Carlo laughing with guests at head table"],["CUT TO:","Long shot of guests dancing"],["CUT TO:","FBI arrive at entrance"],["CUT TO:","Clemenza dancing with his wife"],["CUT TO:","FBI take license plate numbers"],["CUT TO:","Tessio sitting at a table with Carmella & twins, tossing himself an orange"],["CUT TO:","FBI continuing to take license plate numbers"],["CUT TO:","Don Barzini arrives"],["VITO","Eh, Don Barzini."],["CUT TO:","Clemenza is dancing, gets tired, and spins off the dancefloor, laughing."],["CLEMENZA","Hey, Paulie! Let me have some wine. Paulie! More wine..."],["PAULIE","Scusi, please  Ah, you look teriff' on the dance floor"],["CLEMENZA","Hey, what are you a dance judge or something? Fatt' i cazzi tuoi  Go take a walk around the neighborhood -- do your job."],["CUT TO:","Sonny pinches Lucy Mancini's cheek as he walks towards his wife, Sandra"],["SONNY","Hey Sandra, do me a favor, huh; watch the kids -- don't let'em run wild, all right?"],["SANDRA","Well, you watch yourself, all right?"],["CUT TO:","Reception continues with Part 2 of Connie's Wedding Song . We first see Tessio dancing with a young girl standing on his feet. OS: Eh Tessio, cosa fai?"],["CUT TO:","Don Corleone dancing with his wife, Carmella"],["CUT TO:","Connie collecting gifts for her bridal purse. Paulie is watching."],["PAULIE","Twenty- Thirty-grand. In small bills, cash. In that little silk purse. Madon', if this was someone else's wedding, sfortunato !"],["BUTTONMAN","Hey, Paulie! I got two gobbagool... gabagol  an' a prosciutto!"],["PAULIE","Eh, you stupid jerk!"],["CUT TO:","A photographer takes Barzini's picture. Barzini motions to his men to get the camera"],["PHOTOGRAPHER","Eh, what's the matter?"],["CUT TO:","Tom going up to his wife, Theresa, who's sitting at a table at the reception"],["TOM","I have to go back to work"],["THERESA","Oh, Tom"],["TOM","It's part of the wedding: No Sicilian can refuse any request on his daughter's wedding day."],["LUCA","Don Corleone, I am honored and grateful that you have invited me to your home..."],["CUT TO:","Sonny goes out into the driveway to see the FBI guys. The Mazurka ends."],["SONNY","Eh -- what's this -- Get outta here; it's a private party, go on!  What's is it? Hey, it's my sister's wedding  Goddamn FBI don't respect nothing   Eh, come here; come here; come here; come here, come here; come here; come here..."],["NAZORINE","He was captured by the American army. Then he was sent to New Jersey, as a prisoner of war... *"],["CUT TO:","Nazorine and Enzo in Don Corleone's office -day"],["NAZORINE","But towards the end, he was uh paroled to help with the American uh war effort. So for the last six months he's been working in my pastry shop."],["VITO","Nazorine, my friend, what can I do for you?"],["NAZORINE","Well now that the war is over, this boy, Enzo -- they want to repatriate him back to Italy. Godfather, I have a daughter. You see, she and Enzo..."],["VITO","You want Enzo to stay in this country, and you want your daughter to be married."],["NAZORINE","You understand everything."],["VITO","Bene."],["NAZORINE","Mr. Hagen, thank you.  An' wait til you see the beautiful wedding cake I made for your daughter! Ooof!  Like this! The bride and the groom and the angel..."],["TOM","Who should I give this job to?"],["VITO","Not to our paisan. Give it to a Jew congressman, in another district. Who else is on the list?"],["CUT TO:","Michael and Kay arrive, make some introductions. Kay says hello to one of the guests, and someone says Michael's name. They dance to \"Ev'rytime I Look In Your Eyes\" as the Don watches from his window -day"],["CUT TO:","The Don's office -day"],["TOM","He's not on the list, but Luca Brasi wants to see you"],["VITO","Is this -- Is this necessary?"],["TOM","He didn't expect to be invited to the wedding, so he wanted to thank you."],["VITO","All right."],["CUT TO:","Outside of the Corleone residence, Luca sits, rehearsing his lines -day"],["LUCA","Don Corleone, I am honored and grateful that you have invited me to your home on the wedding day of your daughter. And may their first child be a masculine child.  Don -- Don Corleone..."],["KAY","Michael, that man over there is talking to himself. See that scary guy over there?"],["LUCA","...on the wedding day of your daughter..."],["MICHAEL","He's a very scary guy."],["KAY","Well, who is he? What's his name?"],["MICHAEL","His name is Luca Brasi -- an' he helps my father out sometimes."],["KAY","Oh, Michael, wait a minute; he's coming over here..."],["TOM","Mike!"],["MICHAEL","Oh!"],["TOM","Heh...! You look terrific!"],["MICHAEL","My brother, Tom Hagen -- this is Kay Adams."],["TOM","How do you do."],["KAY","How do you do, Tom"],["TOM","Your father's been asking for you  Very nice to meet you"],["KAY","Nice to meet you  If he's your brother, why does he have a different name?"],["MICHAEL","Oh, ah, that -- when my brother Sonny was a kid, he found Tom Hagen in the street. And he had no home -- and so my father took him in -- and he's been with us ever since. He's a good lawyer. Not a Sicilian, but -- I think he's gonna be consiglieri."],["KAY","What's that?"],["MICHAEL","That's um, like a counselor -- an advisor -- very important to the family.  You like your lasagna?"],["CUT TO:","Luca Brasi in Don Corleone's office -day"],["LUCA","Don Corleone, I am honored and grateful that you have invited me to your daugh-- ter's wedding...  ...on the day of your daughter's wedding. And I hope that their first child be a masculine child. I pledge my ever-ending loyalty. --   For your daughter's bridal purse."],["VITO","Thank you, Luca, my most valued friend."],["LUCA","Don Corleone, I'm gonna leave you now, because I know you are busy."],["VITO","Thank you."],["CUT TO:","Bride & groom dance to \"The Godfather Fox Trot\""],["CUT TO:","Sonny moves closer to Lucy to whisper into her ear"],["CUT TO:","Sandra gestures to other women about the size of Sonny's manhood; they laugh; Sandra turns to see Lucy get up to meet Sonny"],["CUT TO:","Singing and dancing on stage"],["VOICE","Signora Corleone! --"],["MAMA","No -- no -- no!   La stessa storia?  La stessa storia!"],["CUT TO:","Sonny goes upstairs"],["CUT TO:","An old man continues \"Luna Mezz'a Mare\" while Nazorine dances and laughs on stage"],["CUT TO:","Lucy Mancini goes upstairs"],["CUT TO:","The old man who was singing is now dancing"],["CUT TO:","Don's office."],["TOM","Senator Cauly apologized for not coming personally -- he said you'd understand. Also, some of the judges. They've all sent gifts.  Salute!"],["VITO","What is that outside?"],["CUT TO:","Outside, Johnny Fontane enters the party, signing autographs"],["CONNIE","Johnny! Johnny! Johnny! I love you!"],["CUT TO:","Don's office. The Don is looking out the window"],["VITO","He came all the way from California to come to the wedding; I told you he was going to come."],["TOM","It's been two years; he's probably in trouble again."],["VITO","He's a good godson."],["CUT TO:","Bandstand area -day"],["MAMA","Johnny, Johnny! \"Sing a song\"  Sing a song."],["CUT TO:","Michael and Kay's table -day"],["KAY","Mike, you never told me you knew Johnny Fontane!"],["MICHAEL","Sure... You wanna meet him?"],["KAY","Huh? Oh, well, sure!"],["MICHAEL","My father helped him with his career."],["JOHNNY","For my Connie..."],["KAY","He did? How?"],["JOHNNY","\"I have but one heart...\""],["MICHAEL","Let's listen to the song..."],["KAY","Oh, Michael..."],["CUT TO:","Johnny singing to Connie, who's seated. Then"],["PAN:","the crowd cheering and screaming as Johnny sings"],["JOHNNY","\"...this heart I bring you \/ I have but one heart \/ To share with you \/ I have but one dream \/ That I can cling to \/ You are the one dream\/I pray comes true...\""],["KAY","Please, Michael, tell me."],["JOHNNY","\"My darling, until I saw you...\""],["MICHAEL","Well, when Johnny was first starting out, he was signed to this personal service contract; with a big band leader. And as his career got better and better, he wanted to get out of it. Now, Johnny is my father's godson. And my father went to see this band leader, and he offered him $10,000 to let Johnny go. But the band leader said no. So the next day, my father went to see him; only this time with Luca Brasi. And within an hour, he signed a release, for a certified check for $1,000."],["KAY","How'd he do that?"],["MICHAEL","My father made him an offer he couldn't refuse."],["KAY","What was that?"],["MICHAEL","Luca Brasi held a gun to his head, and my father assured him that either his brains -- or his signature -- would be on the contract.  That's a true story.  That's my family, Kay. It's not me."],["CUT TO:","Bandstand area -day"],["MAMA","Bene! Bene!"],["VITO","My godson comes all the way from California...give him a glass of wine"],["VOICE","Salute!"],["JOHNNY",""],["VITO","I'll take care of it.  Tom, I want you to find Santino. Tell him to come to the office."],["CUT TO:","Michael and Kay's table at the reception"],["MICHAEL","Oh!  How are you, Fredo?  Fredo -- my brother Fredo -- this is Kay Adams"],["KAY","Oh, hi"],["FREDO","How'ya doing?  This is my brother, Mike."],["MICHAEL","Are you having a good time?"],["FREDO","Huh? yeah...  This your friend, huh?"],["CUT TO:","Johnny Fontane in the Don's office. -day"],["JOHNNY","I don't know what to do. My voice is -- is weak. It's weak. Anyway, uh, if I had this part in the picture, ya'know, it puts me right back up on top again. But this, uh -- this man out there, he won't give it to me; the head of the studio."],["VITO","What's his name?"],["JOHNNY","Woltz -- Woltz. He -- He won't give it to me -- and ah, he says there's no chance. No chance."],["CUT TO:","Tom looking for Sonny inside the house"],["TOM","Sonny? Sonny?"],["TOM","Sonny? Sonny you in there?"],["SONNY","What?"],["TOM","Your old man wants to see you."],["SONNY","Yeah, one minute."],["LUCY","Oh, Sonny!"],["CUT TO:","A woman singing Italian song, opera-like, on the stage -day"],["CUT TO:","The Don's office"],["JOHNNY","A month ago he bought the movie rights to this book. A bestseller -- and the main character, it's a guy just like me. I uh -- I wouldn't even have to act -- just be myself. Oh, Godfather, I don't know what to do. I don't know what to do."],["VITO","You can act like a man!  What's the matter with you? Is this how you turned out? A Hollywood finocchio that ah cries like a woman?  What can I do?! What can I do?!  What is that nonsense? Ridiculous."],["VITO","You spend time with your family?"],["JOHNNY","Sure I do."],["VITO","Good. 'Cause a man who doesn't spend time with his family can never be a real man.  Come're.  You look terrible. I want you to eat. I want you to rest a while. And in a month from now, this -- Hollywood bigshot's gonna give you what you want."],["JOHNNY","It's too late, they start shooting in a week"],["VITO","I'm gonna make him an offer he can't refuse.  Now you just go outside and enjoy yourself, and ah, forget about all this nonsense. I want you to leave it all to me."],["JOHNNY","All right"],["VITO","Well..."],["CUT TO:","The cake comes out. Nazorine, the baker, takes a proud bow. The Tarantella plays again."],["CUT TO:","The Don's office"],["VITO","What time does my daughter leave with the bridegroom?"],["TOM","In a few minutes, right after they cut the cake.  Now your new son-in-law; give him something important?"],["VITO","Never. Give him a living, but never discuss the Family business with him. What else?"],["TOM","Virgil Sollozzo called. Now we're gonna have to give him a day sometime next week."],["VITO","We'll discuss it when you come back from California."],["TOM","When am I going to California?"],["VITO","I want you to go tonight; I want you to talk to this -- movie bigshot, and settle this business for Johnny. Now, if there's nothing else, I'd like to go to my daughter's wedding."],["TOM","Uh -- the hospital called. Um --Consiglieri Genco -- he's not gonna last out the night."],["VITO","Santino, go tell your brothers that I went them to come with me to visit Genco to pay their respects. Tell Fredo to drive the big car... outside now."],["SONNY","Uh, Pop... Michael?"],["VITO","All my sons *"],["CUT TO:","Family portrait scene in the yard  -day"],["MAMA","Carlo, we're gonna take the picture..."],["MICHAEL","Wait a minute..."],["KAY","No, Michael, not me."],["PHOTOGRAPHER","Okay, that's it. Just like that; now, hold it."],["CUT TO:","Connie and the Don dance to \"The Godfather Waltz \""],["CUT TO:","Tom arrives in Hollywood by plane, takes a cab, then walks by foot through Woltz International Pictures. Music: \"Manhattan Serenade\" plays -day"],["JANIE'S MOTHER","Ah, isn't that nice..."],["WOLTZ","All right, start talking."],["TOM","Uh, I was sent by a friend of Johnny Fontane's -- His friend is my client, who'd give his undying friendship to Mr. Woltz, if Mr. Woltz would grant us a small -- favor."],["WOLTZ","Woltz is listening."],["TOM","Give Johnny the part in that new war film you're starting next week."],["WOLTZ","And ah, what favor would ah your friend ah grant Mr. Woltz?"],["TOM","You're gonna have some union problems; my client could make then disappear. Also, one of your top stars has just moved from ah marijuana to heroin..."],["WOLTZ","Are you trying to muscle me?"],["TOM","Absolutely not."],["WOLTZ","Now listen to me, you smooth-talking son-of-a-bitch! Let me lay it on the line for you and your boss, whoever he is. Johnny Fontane will never get that movie! I don't care how many - - daigo guinea WOP greaseball gumbahs come out of the woodwork!"],["TOM","I'm German-Irish..."],["WOLTZ","Well let me tell you something my Kraut Mick friend, I'm gonna make so much trouble for you, you won't know what hit you!"],["TOM","Mr. Woltz, I'm a lawyer, I have not threatened you."],["WOLTZ","I know almost every big lawyer in New York, who the hell are you?"],["TOM","I have a special practice; I handle one client -- Now you have my number; I'll wait for your call -- By the way, I admire your pictures very much."],["WOLTZ","Check him out..."],["CUT TO:","Later, Tom and Woltz walking around Woltz' estate. \"Manhattan Serenade\" plays again. -early evening"],["TOM","This is really beautiful."],["WOLTZ","Well, look at this. It used to decorate the palace of a king."],["TOM","Oh, yeah; very nice."],["WOLTZ","Why didn't you say you worked for Corleone, Tom? I thought you were just some cheap two-bit hustler Johnny was running in trying to bluff me."],["TOM","I don't like to use his name unless it's really necessary."],["WOLTZ","How's your drink, Tom?"],["TOM","Fine"],["WOLTZ","Hey, come on over here with me; I wanna show you something really beautiful. You do appreciate beauty, don't you?  There you are, $600,000 on four hooves. I bet a Russian Czar never paid that kind of dough for a single horse.  Khartoum. Khartoum.  I'm not gonna race him, though. I'm gonna put him out to stud."],["TOM","He's beautiful."],["WOLTZ","Thanks, Tony."],["TONY","You're welcome..."],["WOLTZ","Let's get something to eat, huh?"],["CUT TO:","Woltz' dinner table -early evening"],["TOM","Mr. Corleone is Johnny's godfather. To the Italian people, that's a very religious, sacred, close relationship."],["WOLTZ","I respect that; just tell him he should ask me anything else. But this is one favor I can't give him."],["TOM","He doesn't ask a second favor once he's been refused the first, understood?"],["WOLTZ","You don't understand. Johnny Fontane never gets that movie. That part is perfect for him; it'll make him a big star. And I'm gonna run him out of the business, and let me tell you why.  Johnny Fontane ruined one of Woltz International's most valuable proteges. For five years we had her under training. Singing lessons; acting lessons, dancing lessons. I spent hundreds of thousands of dollars on her. I was gonna make her a big star! And let me be even more frank, just to show you that I'm not a hard-hearted man, and it's not all dollars and cents. She was beautiful; she was young, she was innocent. She was the greatest piece of ass I ever had, and I had'em all over the world! And then Johnny Fontane comes along with his olive- oil voice, and guinea charm. And she runs off. She threw it all away just to make me look ridiculous! And a man in my position can't afford to be made to look ridiculous! Now you get the hell outta here! And if that gumbah tries any rough stuff, you tell him I ain't no band leader! Yeah, I heard that story...."],["TOM","Thank you for the dinner and a very pleasant evening. If your car could take me to the airport; Mr. Corleone is a man who insists on hearing bad news immediately."],["CUT TO:","pan of exterior of Woltz' estate, music is a variation of the Title Theme, then we see the interior of Woltz' bedroom. Woltz awakens in a pool of blood, and finds Khartoum's severed head in his bed; and"],["WOLTZ","ah - ah - ah - ah - ah!"],["DISSOLVE TO:","close-up of Vito Corleone's face; he nods -evening"],["VITO","You're not too tired, are you, Tom?"],["TOM","No, no. I slept on the plane.  I have the Sollozzo notes here. Now -- Sollozzo is known as 'The Turk.' He's supposed to be very good with a knife, but only in matters of business or some sort of reasonable complaint. Uh, his business is narcotics. He has fields in Turkey where they grow the poppy. And in Sicily he has the plants to process them into heroin. Now -- he needs cash, and he needs protection from the police, for which he gives a piece of the action -- I couldn't find out how much. The Tattaglia family is behind him here in New York. Now they have to be in it for something."],["CUT TO:","Sonny introducing himself to Sollozzo, shaking hands -day"],["SONNY","Sonny Corleone..."],["CUT TO:","Back to Don, Sonny and Tom before the meeting -evening"],["VITO","What about his prison record?"],["TOM","Two terms. One in Italy, one here. He's known as a top narcotics man."],["VITO","Santino? Whattaya think?"],["SONNY","There's a lot of money in that white powder."],["VITO","Tom?"],["TOM","Well, I say yes. There's more money potential in narcotics than anything else we're looking at. Now if we don't get into it, somebody else will. Maybe one of the Five Families, maybe all of them. Now with the money they earn, they can buy more police and political power; then they come after us. Now we have the unions, we have the gambling; an' they're the best things to have. But narcotics is a thing of the future. An' if we don't get a piece of that action, we risk everything we have -- I mean not now, but ah ten years from now."],["SONNY","So, what's your answer gonna be, Pop?"],["CUT TO:","Sollozzo meeting in Don Corleone's Genco office. Scene includes the Don, Sollozzo, Tom, Sonny, Fredo, Clemenza, and Tessio sitting in Room #2 -day"],["SOLLOZZO","Bene. Don Corleone. I need a man who has powerful friends. I need a million dollars in cash. I need, Don Corleone, those politicians that you carry in your pocket, like so many nickels and dimes."],["VITO","What is the interests for my family?"],["SOLLOZZO","Thirty percent. In the first year, your end should be three- four-million dollars. And then it would go up."],["VITO","And what is the interest for the Tattaglia Family?"],["SOLLOZZO","My compliments.  I'll take care of the Tattaglia's, outta my share."],["VITO","So I receive thirty percent for finance -- political influence, and legal protection, that's what your telling me?"],["SOLLOZZO","That's right"],["VITO","Why do you come to me? Why do I deserve this generosity?"],["SOLLOZZO","If you consider a million dollars in cash just finance, te salute, Don Corleone."],["VITO","I said that I would see you because, I heard that you're a serious man, to be treated with respect.  But uh, I must say \"no\" to you -- and I'll give you my reasons. It's true, I have a lot of friends in politics, but they wouldn't be friendly very long if they knew my business was drugs instead of gambling, which they rule that as a -- harmless vice. But drugs is a dirty business."],["SOLLOZZO","Don Corleone..."],["VITO","It -- makes -- it doesn't make any difference to me what a man does for a living, understand. But your business is ah -- a little dangerous."],["SOLLOZZO","If you're worried about security for your million, the Tattaglia's will guarantee it."],["SONNY","Aw, you're telling me that the Tattaglia's guarantee our investment?"],["VITO","Wait a minute..."],["VITO","I have a sentimental weakness for my children, and I spoil them as you can see; they talk when they should listen. But, anyway, Signor Sollozzo, my no is final, and I wish to congratulate you on your new business, and I know you'll do very well; and good luck to you -- as best as your interests don't conflict with my interests. Thank you."],["VITO","Santino, come're. Whattsa matter with you? I think your brain is going soft from all that comedy your playing with that young girl. Never tell anybody outside the family what you're thinking again!  Go on...  Tom...  What -- what is this nonsense?"],["TOM","It's from ah Johnny, starring in that new ah film."],["VITO","Ah -- Well, take it away."],["TOM","Take it over there"],["VITO","And uh, tell Luca Brasi to come in."],["CUT TO:","Luca sits down in front of the Don at the Genco office. -day"],["VITO","I'm a little worried about this Sollozzo fella. I want you to find out what he's got under his fingernails, ya'know. Go to the ah Tattaglia's, uh, and ah, make them think that ah you're -- you're not too happy with our family and -- and ah find out what you can."],["FADE FROM BLACK:","Michael and Kay Christmas shopping outside of Best & Co. \"Have Yourself A Merry Little Christmas\" is playing -day"],["KAY","I got something -- I got something for your mother, and for Sonny, and a tie for um um Freddy, and Tom Hagen got the Reynolds pen..."],["MICHAEL","And what do you want for Christmas?"],["KAY","Me? Oh, just you."],["CUT TO:","Luca Brasi getting ready for his meeting: putting on his vest and checking his gun -night y"],["KAY","Hello?"],["VOICE ON THE PHONE","Good afternoon, it's 3 o'clock"],["KAY","Thank you....  Michael, it's 3 o'clock"],["MICHAEL","Wha?"],["KAY","It's 3 o'clock -- we hafta get up -- because we have to go to your father's house..."],["MICHAEL","Why do we have to?"],["KAY","Because we have to..."],["MICHAEL","Ya'know, if we go to my father's house --"],["KAY","uh-huh..."],["MICHAEL","-- we can't push the beds together..."],["KAY","Why not?"],["MICHAEL","Because they're in separate rooms"],["KAY","Well, alright then -- I -- then we won't go -- we won't tell your father..."],["MICHAEL","Okay..."],["KAY","You know, we'll just get married first -- and we'll tell'em later..."],["MICHAEL","I can't do that..."],["KAY","Then Michael, get outta bed"],["MICHAEL","Let's go tomorrow..."],["KAY","Michael, they're expecting us!"],["MICHAEL","Oh, Kay -- get the phone..."],["KAY","What are you gonna do?"],["MICHAEL","Just get the phone..."],["OPERATOR","Yes, may I help you?"],["MICHAEL","Hi, may I please have uh, Orchard-9-9539 please..."],["KAY","What are you doing? -- What are you doing? Are you doing something...?"],["MICHAEL","You're going to be the long-distance operator from New Hampshire  Come on..."],["KAY","I can't do this"],["MICHAEL","You gotta -- come on..."],["TOM","Hello?"],["KAY","Hello, this is long distance calling -- I have a collect call from Mr. Michael Corleone -- um, will you accept the charges?"],["TOM","Yes..."],["KAY","One moment, please..."],["MICHAEL","Hello?"],["TOM","Hello?"],["MICHAEL","Hello, Tom"],["TOM","Hi, Mike, how are you?"],["MICHAEL","Listen -- we're up in New Hampshire still -- we're gonna drive down tomorrow morning..."],["TOM","Is there anything I can do for you?"],["MICHAEL","No, ah -- we're fine. Now, I'm -- I'm gonna see you Christmas -- everybody's goin' out to the mall?"],["TOM","Right..."],["MICHAEL","Okay..."],["TOM","Right, Mikey..."],["MICHAEL","Bye, Tom... *"],["CUT TO:","Don Corleone's office on Mott Street -early evening"],["VITO","Andiamo, Fredo. Tell Paulie to get the car; we're going."],["FREDO","Okay, Pop -- I'll have to get it myself, Pop; Paulie called in sick this morning."],["VITO","Huh?!"],["FREDO","Paulie's a good kid, I don't mind getting the car."],["VITO","Buon Natale, Dano. Grazie cut to: luca brasi walking down hallway to the bar. the trilogy shows some extra footage -night"],["CUT TO:","Luca Brasi's meeting at Tattaglia's bar -night"],["BRUNO TATTAGLIA","Luca, I'm Bruno Tattaglia."],["LUCA","I know"],["BRUNO TATTAGLIA","Su bequero Scotch? Pre-war..."],["LUCA","Io no bib'"],["SOLLOZZO","You know who I am?"],["LUCA","I know you"],["SOLLOZZO","You have been talking to the Tattaglia family...right? I think you and I can do business. I need someone strong like you. I heard you are not happy -- with the Corleone Family. Want to join me?"],["LUCA","What's in it for me?"],["SOLLOZZO","$50,000 -- to start with."],["LUCA","Not bad"],["SOLLOZZO","Agreed?"],["LUCA","Grazie."],["CUT TO:","Tom Hagen exits a store while Christmas shopping. Tom is carrying a sled and some tied-up boxes. \"Santa Claus Is Coming To Town\" is playing. -early evening"],["SOLLOZZO","Tom! Tom Hagen! Merry Christmas!  Heh, I'm glad I run into you; I want to talk to you."],["TOM","Well I haven't got time"],["SOLLOZZO","Aw, make time, consiglieri. Get in the car.  What are you worried about? If I wanted to kill you, you'd be dead already  Get in."],["DISSOLVE TO:","The Don and Fredo leaving the Genco office -late afternoon"],["VITO","Ah, Aspetta, Fredo; I'm gonna buy some fruit"],["FREDO","Okay, Pop"],["VITO","Ah, hi, Merry Christmas; I wan' some fruit over there. What is this? Gimme three. And that one..."],["FREDO","I can't -- I can't -- Papa!!"],["CUT TO:","Michael and Kay walking outside of Radio City Music Hall, which is showing Leo McCarey's \"The Bells of St. Mary's\" which Michael and Kay just saw. The music playing is \"Bells of St. Mary's\" -evening"],["KAY","Mike, would you like me better if I were a nun? Like in the story, you know?"],["MICHAEL","No."],["KAY","Then would you like me better if I were Ingrid Bergman?"],["MICHAEL","Now that's a thought..."],["KAY","Michael..."],["MICHAEL","No, I would not like you better if you were Ingrid Bergman."],["KAY","Michael..."],["MICHAEL","What's the matter?"],["KAY","Michael..."],["MICHAEL","They don't say if he's dead or alive..."],["MICHAEL","Sonny -- Michael."],["SONNY","Michael, where you been?"],["MICHAEL","Is he all right?"],["SONNY","We don't know yet. There's all kinds of stories.  He was hit bad, Mikey...  Are you there?"],["MICHAEL","Yeah, I'm here."],["SONNY","Where you been? I was worried."],["MICHAEL","Didn't Tom tell you? I called."],["SONNY","No -- look, come home, kid. You should be with Mama, ya'hear?"],["MICHAEL","Alright..."],["CUT TO:","Sonny's house just after talking to Michael on the phone. Sonny hangs up. -night"],["SANDRA","Oh my God..."],["SANDRA","Oh! Sonny!"],["SONNY","Get back -- go  Who is it?"],["CLEMENZA","Open up -- It's Clemenza"],["SONNY","What?"],["CLEMENZA","There's more news about your old man. The word is out on the street that he's already dead"],["SONNY","Watch your mouth -- what's the matter with you?"],["CLEMENZA","Jesus Christ; take it easy -- take it easy"],["SONNY","Where was Paulie?"],["CLEMENZA","Paulie was out sick. He been calling sick all winter."],["SONNY","How many times has he been sick?"],["CLEMENZA","Only maybe three, four times. I mean --"],["SONNY","3, 4 times?"],["CLEMENZA","-- I asked Freddy if he wants me to get a different bodyguard and he said \"no.\""],["SONNY","Listen, do me a favor, pick him up right now, I don't care how sick he is. If he's breathing, I want you to bring him to my father's house. Now, you understand? Now."],["CLEMENZA","Yeah. You want me to send any people over here?"],["SONNY","No. No. No -- Just you and him. Ga'head."],["CLEMENZA","Alright..."],["SONNY","Look, uh... I'll be having a couple people come over to the house. A couple of our people..."],["SONNY","Hello?"],["SOLLOZZO","Santino Corleone?"],["SONNY","Yeah..."],["SOLLOZZO","We have Tom Hagen. In about three hours he'll be released with our proposition --"],["SOLLOZZO","-- Listen to everything he has to say before you do anything. What's done is done.  And don't lose that famous temper of yours, huh Sonny?"],["SONNY","No, I'll wait..."],["CUT TO:","An abandoned diner \/ Sollozzo with kidnapped Tom Hagen -night"],["SOLLOZZO","Your boss is dead. I know you're not in the muscle-end of the family, Tom, so I don't want you to be scared. I want you to help the Corleone's, and I want you to help me.  Yeah, we got him outside his office just about an hour after we picked you up.  Drink it.  So now it's up to you to make the peace between me and Sonny.  Sonny was hot for my deal, wasn't he? And you knew it was the right thing to do."],["TOM","Sonny'll come after you with everything he's got."],["SOLLOZZO","That'll be his first reaction, sure. That's why you gotta talk some sense into him. The Tattaglia family is behind me with all their people. The other New York Families will go along with anything that will prevent a full-scale war. Let's face it, Tom, and all due respect, the Don, rest in peace, was -- slippin'. Ten years ago could I have gotten to him?  Well -- now he's dead. He's dead, Tom, and nothing can bring him back. So you gotta talk to Sonny, you gotta talk to the caporegimes, that Tessio and that Fat Clemenza.  It's good business, Tom."],["TOM","I'll try, but even Sonny won't be able to call off Luca Brasi."],["SOLLOZZO","Yeah, well, let me worry about Luca.  You just talk to Sonny -- and the other two kids."],["TOM","I'll to my best."],["SOLLOZZO","Good. Now, you can go.  I don't like violence, Tom. I'm a business man. Blood is a big expense."],["SOLLOZZO","He's still alive. They hit'em with five shots, and he's still alive! Well that's bad luck for me, and bad luck for you if you don't make that deal!"],["CUT TO:","Michael arrives at Corleone compound. A car drops him off at the gate, and he goes inside, seeing family and friends. the trilogy has some extra footage at the beginning of this scene, in the car. -night"],["CLEMENZA","Mike -- Your mother's over in the hospital with your father; looks like he's gonna pull through, thank God."],["CUT TO:","The Don's office with Sonny, Tom, Mike, Tessio, & Clemenza -night"],["SONNY","Whattaya think --"],["TOM","Too much..."],["SONNY","Huh?"],["CLEMENZA","...it's a lot of bad blood. Sollozzo, Philip Tattaglia, Bruno Tattaglia; Garbone,..."],["TOM","It's too far -- I think it's too personal... The Don'll consider this all..."],["MICHAEL","You kill all those guys?"],["SONNY","Hey, stay out of it, Mickey; do me a favor."],["TOM","Sollozzo's the key. You get rid of him, every falls into line. Now what about Luca? Sollozzo didn't seem to be worried about Luca..."],["SONNY","Aw --I don't know -- if Luca sold out we're in a lot of trouble, believe me. A lot of trouble."],["TOM","Has anyone been able to get in touch with Luca?"],["CLEMENZA","Eh, I've been trying all night. He might be shacked up."],["SONNY","Hey, Mick, do me a favor --"],["TOM","Luca never sleeps over with a broad -- he always goes home when he's through..."],["SONNY","-- try ringing him...  Well, Tom -- you're consiglieri, now what do we do if the old man dies, God forbid."],["TOM","If we lose the old man --"],["TESSIO","... Sollozzo, Philip Tattaglia, ..."],["TOM","-- we lose our political contacts and half our strength. The other New York Families might wind up supporting Sollozzo just to avoid a long -- destructive war. This is almost 1946 --"],["TESSIO","... my people..."],["TOM","-- nobody wants bloodshed anymore. If your father dies,  you make the deal, Sonny."],["SONNY","That's easy for you to say, Tom, he's not your father!"],["TOM","I'm as much a son to him as you or Mike."],["SONNY","What is it?"],["CLEMENZA","Hey, Paulie, I thought I told you to stay put."],["PAULIE","Well, the guy at the gates say -- say they got a package."],["SONNY","Yeah? Hey, Tessio, go see what it is."],["PAULIE","You want me to hang around?"],["SONNY","Yeah, hang around. You all right?"],["PAULIE","Yeah, I'm fine"],["SONNY","Yeah? --"],["SONNY","-- There's some food in the icebox, you hungry or anything?"],["PAULIE","Nah, it's alright -- thanks..."],["SONNY","How 'bout a drink? Have a little brandy -- that'll help sweat it out. Huh? Go'ahead, baby..."],["PAULIE","Alright, sure -- that might be a good idea..."],["SONNY","Yeah, right.  I want you to take care of that sonofabitch right away. Paulie sold out the old man, that stronz'. I don't want to see him again. Make that first thing on your list, understand?"],["CLEMENZA","Understood."],["SONNY","Hey, Mickey, tomorrow -- get a couple of guys, you go over to Luca's apartment; hang around, waitin' for him to show up..."],["TOM","Uh maybe we shouldn't get Mike uh mixed up in this too directly"],["SONNY","Yeah, listen, uh... hang around the house on the phone an' be a big help, huh?  Try Luca again -- ga'head"],["SONNY","What the hell is this?"],["CLEMENZA","It's a Sicilian message. It means Luca Brasi sleeps with the fishes."],["CUT TO:","Clemenza leaves his house in the morning. Some boys are playing, one is pushing the other in a toy car as the latter yells ah! -morning"],["CLEMENZA","I'm goin' now..."],["MRS. CLEMENZA","What time will you be home tonight?"],["CLEMENZA","I don't know, probably late."],["MRS. CLEMENZA","Don't forget the cannoli!"],["CLEMENZA","Yeah, yeah, yeah, yeah..."],["PAULIE","Rocco, sit on the other side. You block the rearview mirror."],["CLEMENZA","That Sonny's runnin' wild. He's thinkin'a going to the mattresses already. We gotta find a spot over on the West Side. Ya try -- 309 West 43rd Street. You know any gooda spots on the West Side?"],["PAULIE","Yeah, I think about it."],["CLEMENZA","Well think about it while you're drivin', will ya? I wanna hit New York sometime this month.  And watch out for the kids while you're backin' out."],["CUT TO:","Driving under the El Tracks -day"],["CLEMENZA","Hey, Paulie, I want you to go down 39th Street -- Carlo Santos -- you pick up 18 --"],["PAULIE","Yeah..."],["CLEMENZA","-- mattresses for the guys to sleep, while you bring me the bill..."],["PAULIE","Uh-huh, yeah, alright... That......bill"],["CLEMENZA","Ya'know, you make sure they're clean, cuz those guys a'gonna be stuck up in there for a long time, ya'know?"],["PAULIE","They're clean. They told me they exterminate them"],["CLEMENZA","Exterminate? That's a bad word to use: exterminate! Get this guy. Watch out we don't exterminate you"],["PAULIE","You think that's funny, or what?"],["CLEMENZA","Hey, Paulie -- Did you fart?"],["PAULIE","Hey, Rocco, what did you do?"],["ROCCO","Not me -- nothin' -- it wasn't me"],["PAULIE","It's gotta be him, then..."],["CLEMENZA","Pull over, will yah? I gotta take a leak."],["CLEMENZA","Leave the gun. Take the cannoli."],["CUT TO:","Outdoors, outside the Don's kitchen, Michael is sitting on a bench. -day"],["CLEMENZA","Hey, Mike! Hey, Mikey?"],["MICHAEL","Yeah?"],["CLEMENZA","You're wanted on the telephone."],["MICHAEL","Who is it?"],["CLEMENZA","Some girl..."],["MICHAEL","Hello, Kay?"],["KAY","How's your father?"],["MICHAEL","He's good. He's gonna make it."],["KAY","I love you."],["MICHAEL","Huh?"],["KAY","I love you.  Michael?"],["MICHAEL","Yeah, I know."],["KAY","Tell me you love me..."],["MICHAEL","I can't talk..."],["KAY","Can't you say it?"],["MICHAEL","Eh -- I'll see you tonight"],["KAY","Okay"],["CLEMENZA","Hey, Mikey, why don't you tell that nice girl you love her?  I love you with all-a my heart! If I don't see you again soon, I'm a-gonna die!   Heh, come over here, kid, learn something. You never know, you might have to cook for twenty guys someday. You see, you start out with a little bit of oil. Then you fry some garlic. Then you throw in some tomatoes, tomato paste, you fry it; ya make sure it doesn't stick. You get it to a boil; you shove in all your sausage and your meatballs; heh?... And a little bit o' wine. An' a little bit o' sugar, and that's my trick."],["SONNY","Why don't you cut out the crap. I got more important things for you to do.  How's Paulie?"],["CLEMENZA","Oh, Paulie? Won't see him no more..."],["SONNY","Where you going?"],["MICHAEL","To the city."],["SONNY","No... wanna send some bodyguards with him -- alright?"],["MICHAEL","No, I'm just going to the hospital to see Pop"],["SONNY","Never mind; send somebody with him"],["CLEMENZA","Aw, he'll be alright -- Sollozzo knows he's a civilian"],["SONNY","Alright; be careful, huh?"],["MICHAEL","Yes, sir..."],["SONNY","Send somebody with him, anyway..."],["CLEMENZA",""],["CUT TO:","Michael goes to the city, driven by bodyguards -early evening"],["DISSOLVE TO:","Kay's hotel room. Michael and Kay are eating dinner, while \"All of My Life\" plays"],["MICHAEL","I have to go..."],["KAY","Can I go with you?"],["MICHAEL","You know, Kay, there's gonna be detectives there -- people from the Press..."],["KAY","Well, I'll ride in the cab..."],["MICHAEL","I don't want you to get involved..."],["KAY","When will I see you again?"],["MICHAEL","Go back to New Hampshire, and I'll call you at your parents' house."],["KAY","When will I see you again, Michael?"],["MICHAEL","I don't know..."],["CUT TO:","Michael exiting the hotel"],["CUT TO:","The hospital . Michael arrives by cab. He enters the quiet hospital to find no one at the nurse's station. He walks down the hall to check an office, and only sees a half-finished sandwich on a desk. He runs down the hall and up the stairs towards his father's room. He pauses, noticing there is no guard outside the Don's door. He walks around the corner up to Room #2 and hesitates before he pushing the door open. His father is in the bed, and Michael wonders if he's alive. He walks up to the Don. -night"],["NURSE","What are you doing here? You're not supposed to be here now!"],["MICHAEL","I'm Michael Corleone -- this is my father.  There's nobody here. What happened to the guards?"],["NURSE","Your father just had too many visitors. They interfered with hospital service. The police made them leave about ten minutes ago."],["MICHAEL","Ah, Get me, ah, Long Beach-4-5620, please...  Nurse, wait a minute. Stay here.  Sonny -- Michael. I'm at the hospital."],["SONNY","Yeah?"],["MICHAEL","Listen -- I got here late. There's nobody here."],["SONNY","What? Nobody?"],["MICHAEL","Nobody... no no no Tessio's men, no detectives, nobody. Papa's all alone."],["SONNY","Don't panic -- I'll send somebody..."],["MICHAEL","I won't panic!"],["NURSE","I'm sorry; but you will have to leave."],["MICHAEL","Uhh... You and I are gonna moo -- move my father to another room. Now can you disconnect those tubes so we can move the bed out?"],["NURSE","That's out of the question!"],["MICHAEL","You know my father? Men are coming here to kill him. You understand? Now help me, please."],["MICHAEL","Who are you?"],["ENZO","I am Enzo, the baker -- Do you remember me?"],["MICHAEL","Enzo..."],["ENZO","Yes, Enzo..."],["MICHAEL","You better get out of here, Enzo; there's gonna be trouble..."],["ENZO","If there is trouble, I stay here to help you. For your father -- for your father"],["MICHAEL","Alright... Listen, wait for me outside in front of the hospital. Alright? I'll be out in a minute. Go ahead..."],["ENZO","Okay... okay."],["MICHAEL","Just lie here, Pop. I'll take care of you now. I'm with you now. I'm with you..."],["MICHAEL","Get rid of these  Come 'ere... Put your hand in your pocket like you have a gun. You'll be alright.  You'll be okay..."],["MICHAEL","You did good."],["OFFICER","Now hold still..."],["McCLUSKEY","I thought I got all you guinea hoods locked up! What the hell are you doing here?"],["MICHAEL","What happened to the men who were guarding my father, captain?"],["McCLUSKEY","Why you little punk! What the hell are you doing telling me my business? I pulled them guys off of here, eh! -- now you get outta here -- and stay away from this hospital!"],["MICHAEL","I'm not moving until you put some guards around my father's room"],["McCLUSKEY","Phil, take him in!"],["OFFICER PHIL","The kid's clean, Captain. He's a war hero. He's never been busted for the rackets..."],["McCLUSKEY","Goddamn it, I said take him in!"],["MICHAEL","What's the Turk paying you to set up my father, Captain?"],["McCLUSKEY","Take a hold of him. Stand him up. Stand'im up straight."],["TOM","I'm attorney for the Corleone family. These men are private detectives hired to protect Vito Corleone. They're licensed to carry firearms. If you interfere, you'll have to appear before a judge in the morning and show cause."],["McCLUSKEY","Alright... let'im go.  Come on!"],["DISSOLVE TO:","Corleone mall, during the day. Tom, Clemenza and Michael get out of the car and walk through the gate, noticing armed men all over the mall. Tessio greets them. -day"],["CLEMENZA","What's with all the new faces?"],["TESSIO","We'll need'em now. After the hospital thing, Sonny got mad. We hit Bruno Tattaglia 4 o'clock this morning."],["CLEMENZA","Jesus Christ...  It looks like a fortress around here..."],["CUT TO:","Inside the Corleone office -day"],["SONNY","Tom-anuch! Hey, a hundred button men on the street twenty-four hours a day; that Turk shows one hair on his ass, he's dead --"],["TOM","Yeah?"],["SONNY","-- believe me...  Hey, Michael, come're, let me look at you. You look beautiful! Beautiful! Just gorgeous!  Hey, listen to this -- the Turk wants to talk. Eh gosh -- imagine the nerve of the sonofabitch, eh? Craps out last night, and wants a meetin' today..."],["TOM","What did he say?"],["SONNY","What did he say -- Badda-beep, badda-bap, badda-boop, badda-beep -- He wants us to send Michael here to proposition. And the promise is, that the deal is so good, that we can't refuse. Eh..."],["TOM","What about Bruno Tattaglia?"],["SONNY","That's part of the deal -- Bruno cancels out what they did to my father..."],["TOM","Sonny, we ought to hear what they have to say..."],["SONNY","No; no; no! No more! Not this time, consiglieri. No more meetin's, no more discussions, no more Sollozzo tricks. You give'em one message: I want Sollozzo -- if not, it's all-out war -- we go to the mattresses..."],["TOM","Some of the other families won't sit still for all-out war!"],["SONNY","Then they hand me Sollozzo!"],["TOM","Your father wouldn't want to hear this! This is business, not personal, Sonny!"],["SONNY","They shot my father -- that's business? Your ass..."],["TOM","Even the shooting of your father was business, not personal, Sonny!"],["SONNY","Well, then, business will have to suffer, alright? And listen -- do me a favor, Tom -- No more advice on how to patch things up. Just help me win, please, alright?"],["TOM","I found out about this Captain McCluskey who broke Mike's jaw..."],["SONNY","What about 'im?"],["TOM","Now he's definitely on Sollozzo's payroll, and for big money. McCluskey has agreed to be the Turk's bodyguard. What you have to understand, Sonny, is that while Sollozzo is being guarded like this, he is invulnerable. Now nobody has ever gunned down a New York police captain -- never. It would be disastrous. All the Five Families would come after you, Sonny. The Corleone Family would be outcasts! Even the old man's political protection would run for cover! So do me a favor -- take this into consideration."],["SONNY","Alright. We'll wait."],["MICHAEL","We can't wait."],["SONNY","Huh?"],["MICHAEL","We can't wait. I don't care what Sollozzo says about a deal, he's gonna kill Pop, that's it. That's the key for him. Gotta get Sollozzo."],["CLEMENZA","Mike is right..."],["SONNY","Lemme ask you something, Professor, I mean -- what about McCluskey? Huh? What do we do with this -- cop here?"],["MICHAEL","They wanna have a meeting with me, right? It will be me -- McCluskey -- and Sollozzo. Let's set the meeting. Get our informers to find out where it's gonna be held. Now, we insist it's a public place -- a bar, a restaurant -- some place where there's people so I feel safe. They're gonna search me when I first meet them, right, so I can't have a weapon on me then. But if Clemenza can figure a way -- to have a weapon planted there for me -- then I'll kill 'em both."],["SONNY","Hey, whataya gonna do, nice college boy, eh? Didn't want to get mixed up in the Family business, huh? Now you wanna gun down a police captain, why, because he slapped ya in the face a little bit? Hah? What do you think this is the Army, where you shoot'em a mile away? You've gotta get up close like this and bada-bing! you blow their brains all over your nice Ivy League suit. Come're..."],["MICHAEL","Sonny..."],["SONNY","You're taking this very personal. Tom, this is business and this man is taking it very very personal."],["MICHAEL","Where does it say that you can't kill a cop?"],["TOM","Come on, Mikey..."],["MICHAEL","Tom, wait a minute. I'm talking about a cop -- that's mixed up in drugs. I'm talking about ah - ah - a dishonest cop -- a crooked cop who got mixed up in the rackets and got what was coming to him. That's a terrific story. And we have newspaper people on the payroll, don't we, Tom?  And they might like a story like that."],["TOM","They might, they just might..."],["MICHAEL","It's not personal, Sonny. It's strictly business."],["CUT TO:","Clemenza's Cellar. Clemenza is showing Michael the gun he's to use -day"],["CLEMENZA","It's as cold as they come -- impossible to trace, so you don't worry about prints, Mike. I put a special tape on the trigger, and the butt. Here, try it...  What's the matter, the trigger too tight?"],["MICHAEL","Maron, my ears..."],["CLEMENZA","Yeah, I left it noisy -- that way it scares any pain-in-the-ass innocent bystanders away.  All right, you shot'em both -- now what do you do?"],["MICHAEL","Sit down, finish my dinner..."],["CLEMENZA","Come on, kid, don't fool around. Just let your hand drop to your side, and let the gun slip out. Everybody'll still think you got it. They're gonna be staring at your face, Mike -- so walk outta the place real fast -- but you don't run. Don't look nobody directly in the eye -- but you don't look away, either. Hey, they're gonna be scared stiff of you, believe me, so don't worry about nothin'. You know, you're going to turn out all right. You take a long vacation -- nobody knows where -- and we're gonna catch the hell."],["MICHAEL","How bad do you think it's gonna be?"],["CLEMENZA","Pretty goddamn bad. Probably all the other Families will line up against us. That's alright -- this thing's gotta happen every five years or so -- ten years -- helps to get rid of the bad blood. Been ten years since the last one. You know you got to stop them at the beginning, like they should have stopped Hitler at Munich, They should never've let him get away with that. They were just asking for big trouble. You know, Mike, we was all proud of you -- being a hero and all. Your father, too."],["CUT TO:","The Corleone Dining Room . Sonny, Clemenza, Tessio and Rocco are sitting around, eating Chinese food while waiting for news about where the Sollozzo meeting will take place. Michael smokes as the others eat. -early evening"],["TOM","Nothing. Not a hint. Absolutely nothing -- even Sollozzo's people don't know where the meeting's going to be held."],["MICHAEL","How much time do we have?"],["SONNY","They're gonna pick you up in front of Jack Dempsey's joint in an hour and a half. Exactly an hour and a half."],["CLEMENZA","We could put a tail on them and see how it turns out..."],["SONNY","Sollozzo'd lose our ass going around the block!"],["TOM","What about the negotiator?"],["CLEMENZA","He's over at my place playin' pinochle with a couple of my men. He's happy, they're lettin' him win..."],["TOM","There's too much of a risk for Mike -- maybe we outta call it off, Sonny."],["CLEMENZA","The negotiator keeps on playing cards until Mike comes back safe and sound."],["SONNY","So why don't he just blast whoever's in the goddamn car?"],["CLEMENZA","Too dangerous -- they'd be lookin' for that."],["TOM","Sollozzo might not even be in the car, Sonny!"],["SONNY","I'll get it.  Yeah -- Yeah -- Well, thanks...  Louis' Restaurant in the Bronx."],["TOM","Well is it reliable?"],["SONNY","That's my man in McCluskey's precinct. A police captain's gotta be on call twenty-four hours a day. He signed out at that number between eight and ten. Anybody know this joint?"],["TESSIO","Yeah, sure, I do. It's perfect for us. A small family place, good food. Everyone minds his business. It's perfect. Pete: they got an old-fashion' toilet -- you know, the box, and - and - and - ah the chain-thing. We might be able to tape the gun behind it."],["CLEMENZA","All right. Mike: you go to the restaurant, you eat, you talk for a while, you relax. You make them relax. Then you get up and you go take a leak. No -- better still -- you ask for permission to go. Then when you come back, you come out blastin', and don't take any chances -- two shots in the head apiece."],["SONNY","Hey, listen, I want somebody good -- and I mean very good -- to plant that gun. I don't want my brother coming out of that toilet with just his dick in his hands, alright?"],["CLEMENZA","The gun'll be there..."],["SONNY","All right  Listen, you drive him and you pick him up after the job, okay?"],["CLEMENZA","Come on, let's move..."],["MICHAEL","Thank you, Tom..."],["SONNY","Did he - ah - tell you to drop the gun right away?"],["MICHAEL","Yeah, a million times."],["CLEMENZA","You don't forget: two shots apiece in the head soon as you come out the door, ah? Let's go..."],["MICHAEL","How long do you think it'll be before I can come back?"],["SONNY","At least a year, Mike. Listen - um - I'll square it with Mom, uh - you know, your not seeing her before you leave; and uh, I'll get a message to that girlfriend, when I think the time is right.  Take care, huh?"],["TOM","Take care, Mike..."],["MICHAEL","Tom."],["DISSOLVE TO:","Jack Dempsey's Restaurant . Michael's waiting on the sidewalk until Sollozzo's car pulls up and he gets in. -evening"],["SOLLOZZO","I'm glad you came, Mike. I hope we can straighten everything out. I mean, this is terrible -- it's not the way I wanted things to go at all. It should've never happened."],["MICHAEL","We'll straighten everything out tonight. I don't want my father bothered any more..."],["SOLLOZZO","He won't be, Mike; I swear on my children he won't be. But you gotta keep an open mind when we talk. I mean, I hope you're not a hothead like your brother Sonny. You -- can't talk business with him..."],["McCLUSKEY","Ahh, he's a good kid.  I'm sorry about the other night, Mike. I gotta frisk you, so turn around uh -- on your knees, facing me.  Ah, I guess I'm gettin' too old for my job. Too grouchy -- can't stand the aggravation. You know how it is...  He's clean."],["MICHAEL","We're goin' to Jersey?"],["SOLLOZZO","Maybe..."],["SOLLOZZO","Nice work, Lou."],["CUT TO:","At a table in Louis' Italian Restaurant. The waiter brings a bottle of wine to the table. -evening"],["McCLUSKEY","How's the Italian food in this restaurant?"],["SOLLOZZO","Good -- try the veal -- it's the best in the city."],["McCLUSKEY","I'll have it."],["SOLLOZZO","Capide?   All right.  I'm gonna speak Italian to Mike."],["McCLUSKEY","Go ahead..."],["SOLLOZZO","Me dispiace..."],["MICHAEL","Lassa-i"],["SOLLOZZO","\"What happened to your father was business -- I have much respect for your father -- but your father -- his thinking is old fashioned. You must understand why I had to do that\"..."],["MICHAEL","\"I understand those things...\""],["SOLLOZZO","\"Now let's work through where we go from here... \""],["MICHAEL","...come si diche...?   What I want -- what's most important to me -- is that I have a guarantee: No more attempts on my father's life."],["SOLLOZZO","What guarantees could I give you, Mike? I am the hunted one! I missed my chance. You think too much of me, kid -- I'm not that clever. All I want, is a truce."],["MICHAEL","I have to go to the bathroom. Is that all right?"],["McCLUSKEY","You gotta go, you gotta go...  I frisked him -- he's clean."],["SOLLOZZO","Don't take too long..."],["McCLUSKEY","I've frisked a thousand young punks..."],["CUT TO:","Inside the restroom, Mike's looking for the gun behind the tank: He can't find it"],["CUT TO:","Table. McCluskey glances toward the restroom; Sollozzo smokes"],["CUT TO:","Restroom, when Michael finally finds the gun. He's relieved"],["CUT TO:","Table. McCluskey glances up again"],["CUT TO:","Restroom, where Michael hesitates by the door, preparing himself as a train is loudly heard passing close by, just before he goes back to the dining area"],["CUT TO:","Dining room: Sollozzo and McCluskey watch Michael emerge from the restroom, hesitate at the door, then sit down"],["SOLLOZZO","\"Everything all right? I respect myself -- understand? -- and cannot allow another man to hold me back. What happened was unavoidable. I had the unspoken support of the other Family Dons. If your father were in better health, without his eldest son running things, no disrespect intended, we wouldn't have this nonsense. We will stop fighting until your father is well and can resume bargaining. No vengeance will be taken. We will have peace, but your family should interfere no longer....\""],["DISSOLVE TO:","newspaper stack showing headline: \"Police Hunt Cop Killer\""],["DISSOLVE TO:","newspaper headline: \"City Cracks Down\""],["DISSOLVE TO:","Tessio by a lamp working on a crossword puzzle"],["DISSOLVE TO:","The Sun headline: \"Police Captain Linked With Drug Rackets\""],["DISSOLVE TO:","Clemenza seated on a cot, starting to lie down"],["DISSOLVE TO:","buttonmen seated around table eating -day"],["PAN:","to piano player  -day"],["DISSOLVE TO:","The Daily Mirror: \"Mobster Barzini Questioned in Underworld Feud\""],["DISSOLVE TO:","buttonman writing a letter, sitting on a mattress"],["DISSOLVE TO:","buttonmen at table passing food -day"],["DISSOLVE TO:","newspaper photo of police overlooking a dead body in a bar"],["DISSOLVE TO:","piano player's hands with overlaid newspaper photos"],["DISSOLVE TO:","buttonman standing with back to camera. He's smoking as he exits left"],["OVERLAY:","of newspaper headline: \"Third Month of Gangland Violence\" over:"],["DISSOLVE TO:","pot of spaghetti being dumped into an outside trash can -day"],["DISSOLVE TO:","Clemenza sleeping on cot"],["OVERLAY:","ends, then:"],["DISSOLVE TO:","newspaper with Vito Corleone's picture, with the headline: \"Syndicate Big Shot Vito Corleone Returns Home\""],["DISSOLVE TO:","Exterior of hospital. Ambulance, police, reporters around, and photographers taking pictures. -day"],["VOICE","Hey, come on, let's go ... get in the car"],["CUT TO:","Corleone people gathering at the mall's gate -day"],["CUT TO:","Ambulance driving down the causeway sounding its siren-day"],["CUT TO:","Corleone family gathering at the mall's gate as ambulance pulls up OS-day"],["CUT TO:","Don Corleone's foyer filled with relatives including a crying baby -day"],["ORDERLY","Okay, you take over..."],["FRANKIE","Ow!"],["CLEMENZA","Very nice...!"],["CUT TO:","The Don's bedroom. Vito Corleone is being visited by family members. -day"],["SONNY'S TWIN DAUGHTER","I love you, Grandpa."],["SANDRA","I'm sorry, Pa -- he doesn't know you yet."],["SONNY","All right  Here you are, big guy -- give it to Grandpa"],["FRANKIE","Okay  I hope you get well, Grandpa, and I wish I would see you soon. Love, your grandson, Frank."],["MAMA","Ooohh..."],["SONNY","Go with your mother  Go ahead -- take 'em downstairs -- come on...  Go on, Carlo -- you, too. Go on..."],["CUT TO:","Kitchen, as Mama and others prepare dinner -day"],["SANDRA","...you want all of that chicken cacciatore for you, sweetheart?  Oh, hey, that's enough bread!"],["CONNIE","But I like bread!"],["SANDRA","Oh I know, but how much can you eat?"],["CUT TO:","The Corleone main gate. Children are playing ball, and the ball bounces toward the gate. A buttonman picks it up and tosses it back. -day"],["CUT TO:","The Don's dining room -day"],["CONNIE","What's the matter with you, Carlo?"],["CARLO","Shut up and set the table..."],["CUT TO:","The Don's bedroom. Vito is in bed, holding cards and presents given to him. Clemenza, Tessio, Tom, Fredo and Sonny are standing around the bed. -day"],["TOM","Since McCluskey's killing, the police have been cracking down on most of our operations -- and also the other Families. There's been a lot of bad blood."],["SONNY","They hit us so -- we hit 'em back."],["TOM","Through our contacts in the newspapers, we've been able to put out a lot of material about McCluskey being linked with Sollozzo in the drug rackets. See -- things are starting to loosen up."],["SONNY","And I'm ah sending Fredo to uh Las Vegas, under the protection of uh Don Francesco of L.A -- I want him to rest."],["FREDO","I'm going to learn -- the -- casino business..."],["SONNY","Yeah..."],["VITO","Where's Michael?  Where's Michael?"],["TOM","It was Michael -- who killed Sollozzo. But he's safe -- and we're starting to work to bring him back now."],["CUT TO:","Hallway and stairs as Sonny and Tom descend -day"],["SONNY","I want you to find out where that ol' pimp Tattaglia is hiding -- I want his ass now -- right now!"],["TOM","Hey -- Sonny..."],["SONNY","What?"],["TOM","Things are starting to loosen up a little bit. If you go after Tattaglia all hell's gonna break --"],["SONNY","Oh, Tom..."],["TOM","-- loose. Let -- let the smoke clear -- Pop can negotiate."],["SONNY","No, Pop can't do nothin' til he's better! I'm going to decide what's going to be done --"],["TOM","All right, but your war is costing us a lot of money; nothing's coming in! --"],["SONNY","Whattsa matter?"],["TOM","-- We can't do business."],["SONNY","Well neither can they! Don't worry about it."],["TOM","They don't have our over-head!"],["SONNY","Please, don't worry about it!"],["TOM","We can't afford a stalemate!"],["SONNY","Well, then, there ain't no more stalemate -- I'm gonna end it by killin' that old bastard! I'm gonna...kill..."],["TOM","Yeah, well you're getting a great reputation! -- I hope you're enjoying it..."],["SONNY","Well you just do what I tell you to do! Goddamn it! If I had a wartime consiglieri -- a Sicilian -- I wouldn't be in this shape! Pop had Genco -- look what I got.  I'm sorry, I didn't mean that. Ma made a little dinner -- it's Sunday..."],["TOM","It's alright..."],["CUT TO:","Dining room, the family is eating at the table -evening"],["SONNY","You know niggers are havin' a good time with uh -- our policy banks up there in Harlem -- drivin' them new Cadillacs -- payin' fifty percent on a bet."],["CARLO","I knew that was gonna happen soon as they started makin' big money."],["SONNY","Yeah..."],["CONNIE","Well Papa never talked business at the table, and in front of the kids."],["CARLO","Hey shut up, Connie, when Sonny's talking..."],["SONNY","Hey, don't you ever tell her to shut up -- you got that?"],["CONNIE","okay..."],["MAMA","Santino ... don't interfere."],["CARLO","Hey look, Sonny, Tom -- I'd like to talk to you maybe after dinner. I could be doing a lot more for the Family"],["SONNY","We don't discuss business at the table."],["CUT TO:","Fredo enters the Don's room and sites in the window seat"],["DISSOLVE TO:","Sicilian countryside, during the day. \"The Love Theme\" music plays. Michael is walking with his bodyguards, Fabrizio and Calo. A car drives up to them and stops. Fabrizio opens the door for Tommasino -day"],["FABRIZIO","I kiss your hand, Don Tommasino"],["TOMMASINO","Michele, Why are you so far from the house? You know I'm responsible to your father for your life"],["MICHAEL","I'm with Calo and Fabrizio..."],["TOMMASINO","It's still dangerous. We've heard from Santino in New York -- your enemies know you're here"],["MICHAEL","Did Santino say -- when I can go back?"],["TOMMASINO","Not yet. It's out of the question"],["MICHAEL","Grazie."],["TOMMASINO","Where are you going now?"],["MICHAEL","Corleone."],["TOMMASINO","Take my car..."],["MICHAEL","No -- I want to walk tommasino  Accura!    extra scene from the epic, trilogy & saga: michael, fabrizio and calo are resting under a tree. Michael and Fabrizio are snacking, while Calo tans himself."],["FABRIZIO","Tell us something about New York"],["MICHAEL","How do you know I'm from New York?"],["FABRIZIO","We heard"],["MICHAEL","Where?"],["FABRIZIO","Somebody told us you were a real important -- how do you say -- a pezzonovante -- a big shot"],["MICHAEL","I'm the son of a pezzonovante"],["FABRIZIO","Ah -- Is America as rich as they say?"],["CALO","Stop bothering me with this rich America stuff!"],["FABRIZIO","Eh, shut up..."],["MICHAEL","Bravo! *"],["DISSOLVE TO:","Another section of the Sicilian countryside. Michael, Calo, and Fabrizio are walking. -day"],["DISSOLVE TO:","They walk on a terraced hillside. -day"],["DISSOLVE TO:","Calo, pointing to a town on a hilltop as we hear church bells -day"],["CALO","Michele: Corleone. dissolve to: they walk through empty streets in corleone, sicily. the trilogy has some extra shots leading up to this scene -day"],["MICHAEL","Where have all the men gone?"],["CALO","They're dead from vendettas.  There are the names of the dead"],["DISSOLVE TO:","Country road. -day"],["FABRIZIO","Hey, hey, take me to the America, G.I.! Hey!  Hey, hey, hey, take me to the America, G.I.! Clark Gable! Eh!  America, America, va! take me to the America, G.I.! Clark Gable!"],["DISSOLVE TO:","Sicilian countryside. Young village girls pick flowers and sing. Unaware of Michael, Fabrizio and Calo watching them. One of the girls, Apollonia, is startled when she sees Michael. After an exchange of looks, Apollonia turns and walks away, saying something in Italian. -day"],["FABRIZIO","Mama mia what a beauty Apollonia"],["FABRIZIO","Oh -- I think you got hit by the thunderbolt]"],["CALO","Michele -- In Sicily, women are more dangerous than shotguns"],["DISSOLVE TO:","A small village cafe. We hear \"Sicilian Pastorale.\" The owner, Vitelli, after yelling something into the kitchen, welcomes the guests, who are seating themselves at a table. -day"],["VITELLI","Did you have a good hunt?"],["FABRIZIO","You know all the girls around here? We saw some real beauties  One of them struck our friend like a thunderbolt"],["CALO",""],["FABRIZIO","She would tempt the devil himself"],["CALO","...tempt the devil..."],["VITELLI","Ah, I understand -- really put together..."],["FABRIZIO","Really put together, eh Calo?"],["CALO","...together"],["VITELLI",""],["FABRIZIO","Such hair -- such mouth!"],["CALO","A bocca..."],["VITELLI","Ah, he girls around here are beautiful -- but virtuous, ah?"],["FABRIZIO","This one had a purple dress -- and a purple ribbon in her hair"],["CALO","...a purple ribbon..."],["FABRIZIO","...a type more Greek than Italian"],["CALO","Piu Greca d'Italiana"],["FABRIZIO","Do you know her?"],["VITELLI","NO! -- There's no girl like that in this town!"],["FABRIZIO","My God, I understand!"],["MICHAEL","What's wrong?"],["FABRIZIO","Let's go -- it's his daughter"],["MICHAEL","Tell him to come here"],["FABRIZIO","You don't understand -- it's his daughter!"],["MICHAEL","No, no, no, no -- Call him"],["MICHAEL","Fabrizio--traducce per me"],["FABRIZIO","Si, Signor."],["MICHAEL","I apologize if I offended you..."],["FABRIZIO","(translates)"],["MICHAEL","I am a stranger in this country..."],["FABRIZIO","(translates)"],["MICHAEL","And I meant no disrespect to you, or your daughter..."],["FABRIZIO","(translates)"],["VITELLI","Who is this? He sounds American..."],["MICHAEL","I am an American -- hiding in Sicily..."],["FABRIZIO","(translates)"],["MICHAEL","My name is Michael Corleone..."],["FABRIZIO","(translates)"],["MICHAEL","There are people who'd pay a lot of money for that information..."],["FABRIZIO","(translates)"],["MICHAEL","But then your daughter would lose a father..."],["FABRIZIO","(translates)"],["MICHAEL","...instead of gaining a husband."],["FABRIZIO","(translates)"],["CALO","Ah --"],["MICHAEL","I wanna meet your daughter..."],["FABRIZIO","(translates)"],["MICHAEL","...with your permission..."],["FABRIZIO","(translates)"],["MICHAEL","...and under the supervision of your family"],["FABRIZIO","(translates)"],["MICHAEL","With all -- respect"],["FABRIZIO","(translates)"],["VITELLI","Come to my house Sunday. My name is Vitelli..."],["MICHAEL","Grazie -- e como se chiama, vostra figlia?"],["VITELLI","Apollonia."],["MICHAEL","Bene."],["DISSOLVE TO:","Tommasino's Villa courtyard. Michael, Calo, and Fabrizio get ready to drive to Vitelli's. The Love Theme plays. -day"],["DISSOLVE TO:","Vitelli's Yard. Michael, holding gifts, is introduced to each of the relatives, then to Apollonia, after she descends the steps and sits on the bench beside her mother. -day"],["VITELLI","E guesta mia figlia, Apollonia -- e guesto Michele Corleone"],["APOLLONIA","Grazie"],["MICHAEL","Prego"],["DISSOLVE TO:","Vitelli's Cafe. Michael and his bodyguards drive up to the cafe and sit with Vitelli, who is jovial, and his family. -day"],["VITELLI","What happened to your eye..."],["MICHAEL","No - no - it's okay..."],["CUT TO:","Hilltop in the village. Michael and Apollonia are walking and talking. Behind them walk many female relatives. Behind the women, Fabrizio and Calo with their luparas. -day"],["CUT TO:","Lucy Mancini's apartment building . Three bodyguards are pitching pennies outside where Sonny's car is parked. There are others inside the lobby and on the stairs. -day"],["CUT TO:","Outside Lucy's apartment door. She pushes the door open, revealing Sonny in an embrace with her. Sonny jumps back as though goosed. -day"],["SONNY","Hey! I'm gonna knock you dizzy.  Save it for the library -- Come on, we got to go pick up my sister -- let's go."],["CUT TO:","Connie and Carlo's apartment. Connie unlocks the door for Sonny, turning away from him as he enters. -day"],["SONNY","Wha's the matter?  Huh? What'sa matter?"],["CONNIE","It was my fault!"],["SONNY","Where is he?"],["CONNIE","Sonny, please, it was my fault -- Sonny, it was my fault! I hit him -- I started a fight with him. Please let me be -- I hit him, so he hit me. I didn't -- I --"],["SONNY","Sh sh sh sh sh -- Okay. -- I'm just uh -- I'm just gonna get a doctor to come and take a look at you, alright?"],["CONNIE","Sonny, please don't do anything -- please don't do anything!"],["SONNY","Okay -- What's the matter with you? What am I gonna do -- I'm gonna make that baby an orphan before he's born or what? Huh? Hmmm?  All right?"],["CUT TO:","City street. Carlo is seated on a stoop with two men. -day"],["CARLO","This fat slob's still bettin' the Yankees pretty heavy? You tell 'em to stop takin' action on 'em, alright?  We lost enough money last week on the game..."],["SONNY","Carlo, come'ere! -- come'ere!, come'ere!, come'ere!  You bastard!"],["SONNY","You touch -- my sister again, I'll kill ya."],["CUT TO:","Village church in Sicily. Traditional Sicilian wedding music plays as the church bells ring. The priest blesses Michael and Apollonia as they kneel at the church's entrance. Apollonia's family, and other townspeople are gathered around. Fabrizio and Calo look on. -day"],["PRIEST","In nomine Patri -- et Filii -- et Spiritus Sancti -- Amen"],["CUT TO:","Village square, where Michael and Apollonia and guests are dancing at the reception, to the Mazurka . -day"],["DISSOLVE TO:","Michael's bedroom, at night. Michael opens the shutters. Apollonia stands in her wedding slip, seemingly a little nervous. Michael goes and kisses her. She lets down her slip. They embrace and kiss. -night"],["CUT TO:","Corleone main gate. Kay gets out of a cab and a buttonman lets her through the gate. Tom hurries out of the house to meet her. -day"],["TOM","Hey! We weren't expecting you, Kay -- you should call"],["KAY","Yes, well -- I have. I mean I've tried writing and calling. Now -- I want to reach Michael"],["TOM","Nobody knows where he is. We know that he's alright, but that's all."],["KAY","Uh --  what was that?"],["TOM","Well that's an accident, but nobody was hurt..."],["KAY","Tom --  will you give this -- letter to Michael, please? Please?"],["TOM","Well, if I accepted that -- in a court of law they could prove that I have knowledge of his whereabouts. Now you just be patient, Kay -- he'll get in touch with you, alright."],["KAY","I let my cab go -- so can I come in to call another one, please?"],["TOM","Come on, I'm sorry -- come on."],["DISSOLVE TO:","Connie and Carlo's apartment. The phone rings, and Connie enters to pick it up. -evening?"],["CONNIE","Hello -- hello?"],["WOMAN","Is Carlo there?"],["CONNIE","Who's this?"],["WOMAN","This is a friend of Carlo's -- would you tell him that I can't make it tonight until later?"],["CONNIE","...bitch!"],["CUT TO:","Bedroom, where Carlo is tying his tie in a mirror. Connie comes in."],["CONNIE","Dinner's on the table..."],["CARLO","I'm not hungry yet."],["CONNIE","The food is on the table -- it's getting cold"],["CARLO","I'll eat out later."],["CONNIE","You just told me to make you dinner!"],["CARLO","Hey, bafangool, eh?  Leave me alone"],["CONNIE","Ah, bafangool, you!"],["CARLO","this little guinea brat..."],["CUT TO:","Kitchen, where Connie is breaking dishes."],["CARLO","That's it, break it all you spoiled guinea brat -- break it all!"],["CONNIE","Why don't you bring...  Why don't you bring your whore home for dinner? And get..."],["CARLO","Maybe I will! Why not? Yeah you, ga'head..."],["CARLO","Now clean it up!"],["CONNIE","Aw, like hell I will!"],["CARLO","Clean it up! Clean it up, you guinea spoiled brat! Clean it up! Clean it up, I said -- clean it up! Clean that up! Clean it up!"],["CONNIE","You sonofabitch!"],["CARLO","Clean it up! Clean that up you sonofabitch! Clean it! Clean it up!  Yeah yeah -- come on now, kill me. Be a murderer like your father. Come on, all you Corleones are murderers anyway."],["CONNIE","I will! I will! I hate you! I'll kill you! I'll kill you!"],["CARLO","Come on, you -- kill me. Get out here! Get out here!"],["CONNIE","I hate you!"],["CARLO","Ga'head -- now I'll kill you! You guinea brat you! Get out here!"],["CUT TO:","The Don's kitchen. Mama Corleone answers the phone with a Santino Jr in her arms, who's crying loudly. -day"],["MAMA","Connie, what's a' matter -- I can't hear you, what is it? Connie, talk louder -- the baby's crying.  Santino, I can't understand -- I don't know -- I don't understand 'er..."],["SONNY","Shhhh  Yeah, Connie..."],["CONNIE","Carlo... -?- ...now don't you come..."],["SONNY","Listen -- you wait there."],["CONNIE",""],["SONNY","No no -- you just wait there!  Sonofabitch."],["MAMA","What's the matter?"],["SONNY","Sonofabitch!"],["MAMA","What's the matter?"],["SONNY","Sonofa..."],["SANDRA","Sonny...?"],["DISSOLVE TO:","The Corleone mall. Sonny runs out to his car. -day"],["SONNY","Open the goddamn gate -- Get off your ass"],["BUTTONMAN","Come on --"],["TOM","Sonny! Sonny, come on..."],["SONNY","Get out of here!"],["TOM","Move out -- go on!"],["CUT TO:","Causeway tollbooths. We faintly hear a baseball game over a radio. Sonny's car drives up to the tollbooth. He grabs a bill from his pocket and hands it to the toll-collector. The car in front of Sonny's seems to be having a problem moving and Sonny sounds his horn. -day"],["SONNY","Sonofabitch! Come on! Come on!"],["DISSOLVE TO:","The Don's office at night where Tom Hagen is somberly having a drink. A slow, somber version of the Title Theme is heard. The Don enters. -night"],["VITO","Give me a drop...  My wife is crying upstairs. I hear cars coming to the house. Consiglieri of mine, I think you should tell your Don what everyone seems to know..."],["TOM","Ah, I didn't tell Mama anything. I was about to come up and wake you just now and tell you..."],["VITO","But you needed a drink first."],["TOM","Yup..."],["VITO","Well, now you've had your drink."],["TOM","They shot Sonny on the Causeway. He's dead."],["VITO","I want -- all inquiries made. I want no acts of vengeance. I want you to arrange a meeting, with the heads of the Five Families. This war stops now."],["VITO","Call Bonasera -- we need him now."],["CUT TO:","Bonasera, frightened, waiting by an elevator at his funeral parlor -night"],["TOM","This is Tom Hagen. I'm calling for Vito Corleone, at his request. Now -- you owe your Don a service. He has no doubt that you will repay it. Now -- he will be at your funeral parlor in one hour. Be there to greet him."],["CUT TO:","The basement of Bonasera's funeral parlor. From the elevator, two men carry a stretcher forward. Tom and the Don follow as Bonasera, frightened, watches. -night"],["VITO","Well, my friend -- are you ready to do me this service?"],["BONASERA","Yes -- What do you want me to do?"],["VITO","I want you to use all your powers -- and all your skills. I don't want his mother to see him this way...  Look how they massacred my boy..."],["CUT TO:","Tommasino's Villa Courtyard, Sicily. Apollonia, laughing, is trying to drive the car almost hitting the short walls. Michael is teaching her how to drive. The car stops, and Michael gets out. All the while, they are laughing and joking in Italian. -day"],["MICHAEL","It's safer to teach you English!"],["APOLLONIA","I know English...  Monday -- Tuesday -- Thursday -- Wednesday -- Friday -- Sunday -- Saturday... Andiamo! Andiamo!"],["MICHAEL","Aie, bravo!"],["APOLLONIA","Come on! Let's go! Let's go!"],["MICHAEL","A salute, Don Tommasino"],["TOMMASINO",""],["MICHAEL","How are things in Palermo?"],["APOLLONIA","Michael is teaching me to drive -- watch, I'll show you"],["MICHAEL","Come va Palermo?"],["TOMMASINO","Young people don't respect anything anymore. Times are changing for the worse -- Eh -- This place has become too dangerous for you -- I don't think you're safe here. I want you to move to a villa near Siracusa, right now -- Subita, eh?"],["MICHAEL","What's wrong?"],["TOMMASINO","Bad news -- from America. Your brother, Santino -- they killed him"],["APOLLONIA","Michele - Michele, Let's go -- let's go -- you promised me"],["DISSOLVE TO:","The Villa. Calo sits under a tree. Fabrizio is on the wall near the gate. Michael steps out onto the balcony. -day"],["MICHAEL","Fabrizio!"],["FABRIZIO","Yes..."],["MICHAEL","Prepara la macchina"],["FABRIZIO","Are you driving yourself, Boss?"],["MICHAEL","Yes..."],["FABRIZIO","Is your wife coming with you?"],["MICHAEL","No -- I want you to take her to her father's house til I know things are safe..."],["FABRIZIO","Okay -- anything you say, Boss."],["CUT TO:","Villa kitchen. Calo sits at the table, eating, as Michael enters -day"],["MICHAEL","Calo, dov Apollonia?"],["CALO","She's going to surprise you -- she wants to drive. --"],["MICHAEL","Ahh..."],["CALO","-- She'll make a good American wife  Wait, I'll get the baggage..."],["CUT TO:","Villa courtyard. Calo carries suitcases to the car and puts them into the trunk. Apollonia is in the driver's seat. -day"],["MICHAEL","Fabrizio! -- dove vai?"],["APOLLONIA","Michele, wait there! I'll drive to you..."],["MICHAEL","NO! No, Apollonia!  ."],["MICHAEL","Apollonia...?"],["TOMMASINO","Morta"],["MICHAEL","Fabrizio...?  Get me -- Get me -- Fabrizio  Find him... Fabrizio *"],["DISSOLVE TO:","Bank building boardroom in New York City. There are Dons and aides seated and standing around a conference table. Barzini sits at the head of the table. -day"],["VITO","Don Barzini, I want to thank you for helping me organize this -- meeting here today. And also the other heads of the Five Families -- New York and New Jersey. Carmine Corleone from the Bronx -- and ah -- Brooklyn -- Philip Tattaglia. An' from Staten Island, we have with us Victor Strachi. And all the other associates that came as far as from California, and Kansas City, and all the other territories of the country -- thank you.  How did things ever get so far? I don't know. It was so -- unfortunate -- so unnecessary. Tattaglia lost a son -- and I lost a son. We're quits. And if Tattaglia agrees, then I'm willing to -- let things go on the way they were before..."],["BARZINI","We're all grateful to Don Corleone for calling this meeting. We all know him as a man of his word -- a modest man -- he'll always listen to reason..."],["PHILIP TATTAGLIA","Yes, Don Barzini -- he's too modest. He had all the judges and politicians in his pocket. He refused to share them..."],["VITO","When -- when did I ever refuse an accommodation? All of you know me here -- when did I ever refuse? -- except one time. And why? Because -- I believe this drug business -- is gonna destroy us in the years to come. I mean, it's not like gambling or liquor -- even women -- which is something that most people want nowadays, and is ah forbidden to them by the pezzonovante of the Church. Even the police departments that've helped us in the past with gambling and other things are gonna refuse to help us when in comes to narcotics. And I believed that -- then -- and I believe that now."],["BARZINI","Times have changed. It's not like the Old Days -- when we can do anything we want. A refusal is not the act of a friend. If Don Corleone had all the judges, and the politicians in New York, then he must share them, or let us others use them. He must let us draw the water from the well. Certainly he can -- present a bill for such services; after all -- we are not Communists."],["ZALUCHI","I also don't believe in drugs. For years I paid my people extra so they wouldn't do that kind of business. --"],["ZALUCHI","-- Somebody comes to them and says, \"I have powders; if you put up three, four thousand dollar investment -- we can make fifty thousand distributing.\" So they can't resist. I want to control it as a business, to keep it respectable  I don't want it near schools -- I don't want it sold to children! That's an infamia. In my city, we would keep the traffic in the dark people -- the colored. They're animals anyway, so let them lose their souls..."],["VITO","I hoped that we would come here and reason together. And as a reasonable man I'm willing to do whatever's necessary to -- find a peaceful solution to these problems..."],["BARZINI","Then we are agreed. The traffic in drugs will be permitted, but controlled -- and Don Corleone will give up protection in the East -- and there will be the peace."],["PHILIP TATTAGLIA","But I must have strict assurance from Corleone -- as time goes by and his position becomes stronger, will he attempt any individual vendetta?"],["BARZINI","Look -- we are all reasonable men here; we don't have to give assurances as if we were lawyers..."],["VITO","You talk about vengeance -- is vengeance gonna bring your son back to you? Or my boy to me? I forgo the vengeance of my son -- But I have selfish reasons. My youngest son -- was forced to leave this country, --  -- because of this Sollozzo business. All right -- and I have to make arrangements to bring him back here safely -- cleared of all these false charges. But I'm a superstitious man -- and if some unlucky accident should befall him -- if he should get shot in the head by a police officer -- or if he -- should hang himself in his jail cell -- or if he's struck by a bolt of lightning -- then I'm going to blame some of the people in this room. And that, I do not forgive.  But -- that aside -- let me say that I swear -- on the souls of my grandchildren -- that I will not be the one to break the peace that we have made here today..."],["CUT TO:","The Don's car driving -night"],["CUT TO:","Inside the car where the Don and Tom are sitting in the rear -night"],["TOM","When I meet with the Tattaglia people, should I insist that all his drug middlemen have clean records?"],["VITO","Mention it -- don't insist. Barzini is a man who'll know that without being told."],["TOM","You mean Tattaglia..."],["VITO","Tattaglia's a pimp -- he never'a could've outfought Santino. But I didn't know until this day that it was -- Barzini all along... y"],["VITO","Look at this -- tomatoes, peppers -- all of this -- perfecto..."],["MICHAEL","Pop, what about Sonny?  What about Sicily?"],["VITO","I swore that I would never break the peace"],["MICHAEL","But won't they take that as a sign of weakness?"],["VITO","It is a sign of weakness..."],["MICHAEL","Well -- you gave your word that you wouldn't break the peace, I didn't give mine. You don't have to have any part -- I take all responsibility."],["VITO","Well, we have a lot of time to talk about it now *"],["CUT TO:","New Hampshire School. Kay leads a group of children into schoolyard. -day"],["KAY","Come on, Nancy -- keep together, everyone. Blanche -- Okay, all right...  How long have you been back?"],["MICHAEL","I've been back a year. Longer than that, I think.  It's good to see you, Kay..."],["DISSOLVE TO:","Country road. Michael and Kay are walking together as Michael's car follows behind. A boy on his bike passes, followed by his dog. -day"],["BOY","Come on, Dano!"],["MICHAEL","I'm working for my father now, Kay. He's been sick -- very sick."],["KAY","But you're not like him, Michael. I thought you weren't going to become a man like your father. That's what you told me..."],["MICHAEL","My father's no different than any other powerful man --  -- Any man who's responsible for other people. Like a senator or a president."],["KAY","You know how naive you sound?"],["MICHAEL","Why?"],["KAY","Senators and presidents don't have men killed..."],["MICHAEL","Oh -- who's being naïve, Kay?  Kay, my father's way of doing things is over -- it's finished. Even he knows that. I mean in five years, the Corleone Family is going to be completely legitimate. Trust me. That's all I can tell you about my business  Kay..."],["KAY","Michael, why did you come here? Why? What do you want with me after all this time? Here I was calling and writing..."],["MICHAEL","I came here because I need you -- because I care for you --"],["KAY","Please stop it, Michael..."],["MICHAEL","-- because -- I want you to marry me..."],["KAY","It's too late -- it's too late..."],["MICHAEL","Please, Kay --I'll do anything you ask -- anything to make up -- for what's happened to us...  ...because that's important Kay. Because what's important is that -- we have each other. That we have a life together -- that we have children. Our children...  Kay -- I need you. And I love you."],["DISSOLVE TO:","The Don's office. The Don is feeding the fish in his aquarium."],["TESSIO","Barzini's people chisel my territory, and we do nothing about it. Pretty soon there won't be one place in Brooklyn I can hang my hat!"],["MICHAEL","Just be patient..."],["TESSIO","I'm not asking you for help, Mike -- just take off the handcuffs."],["MICHAEL","Be patient."],["CLEMENZA","We got to protect ourselves -- Give me a chance to recruit some new men."],["MICHAEL","No -- I don't want to give Barzini an excuse to start fighting."],["TESSIO","Mike, you're wrong..."],["CLEMENZA","Don Corleone -- you once said that the day would come when Tessio and me could form our own Family. Til today, I would never think of it. I must ask your permission..."],["VITO","Well, Michael is now head of the Family, and if he gives his permission, then you have my blessing..."],["MICHAEL","After we make the move to Nevada -- you can break off from the Corleone Family and go on your own. After we make the move to Nevada."],["CLEMENZA","How long with that be?"],["MICHAEL","Six months."],["TESSIO","Forgive me, Godfather, but with you gone -- me and Pete'll come under Barzini's thumb sooner or later..."],["CLEMENZA","And I hate that goddamn Barzini! In six months' time there won't be nothing left to build on..."],["VITO","Do you have faith in my judgment?"],["CLEMENZA","Yes..."],["VITO","Do I have your loyalty?"],["CLEMENZA","Yes -- always, Godfather..."],["VITO","Then be a friend to Michael, and do as he says."],["MICHAEL","There are things being negotiated now that are gonna solve all your problems and answer all your questions. That's all I can tell you now...  Carlo, you grew up in Nevada. When we make our move there, you're gonna be my right- hand man.  Tom Hagen's no longer Consiglieri -- He's gonna be our lawyer in Vegas. That's no reflection on Tom, but that's the way I want it.  Besides -- if I ever need help, who's a better Consiglieri than my father? Well, that's it."],["TESSIO","Alright..."],["CARLO","Thank you, Papa..."],["VITO","I'm happy for you, Carlo."],["TOM","Mike, uh - why am I out?"],["MICHAEL","You're not a wartime Consiglieri, Tom. Things may get rough with the move we're trying."],["VITO","Tom -- I advise Michael. I never thought you were a bad Consiglieri. I thought -- Santino was a bad Don, rest in peace. Michael has all my confidence, as - as you do. But uh -- there are reasons why you must have no part in what is going to happen."],["TOM","Maybe I could help..."],["MICHAEL","You're out, Tom."],["DISSOLVE TO:","A montage of Las Vegas: The Desert Inn featuring Patti Page, El Rancho Vegas featuring Joe E. Lewis & Gloria DeHave, and the Sands featuring Dean Martin & Jerry Lewis. We hear Vegas-style music. -day"],["DISSOLVE TO:","Las Vegas hotel. A limo drives to the entrance, and Fredo and Michael get out"],["DISSOLVE TO:","Fredo, Michael, Hagen, Neri, Rocco and bellboys walk towards a hotel room"],["FREDO","I can't get over the way your face looks -- it really looks good. This doctor did some job. Who talked you into it, Kay?  Hey hey hey hey hey, wait! Hey -- leave them out here -- we'll deal with them later...  He's tired -- he wants to clean up. But right now, let me open the door, alright?"],["JOHNNY","Hello, Mike -- Welcome to Las Vegas!"],["FREDO","It's all for you, kid -- eh  It's all his idea, right? Didn't you --"],["JOHNNY","Well, your brother Freddy..."],["FREDO","Well it was -- hey, girls here... Hah -- I'll be right back..."],["JOHNNY","All right -- okay"],["FREDO","You keep 'em occupied...  Anything you want, kid -- anything. Huh?"],["MICHAEL","Who are the girls?"],["FREDO","That's for you to find out..."],["MICHAEL","Get rid of them, Fredo."],["FREDO","Hey, Mike... uh..."],["MICHAEL","Fredo, I'm here on business -- I leave tomorrow, now get rid of them. I'm tired.  Get rid of the band, too."],["FREDO","Hey, just take off! Come on, take off! Let's go. Hey -- Angelo...  Hey, come on -- SCRAM!"],["JOHNNY","Come on, honey, let's go"],["FREDO","Come on... I don't know, Johnny -- I don't know what the hell's the matter with him.  I'm sorry, babe, come on --  I don't know, he's tired...he's..."],["MICHAEL","What happened to Moe Greene?"],["FREDO","He said he had some business. He said give him a call -- when the party started."],["MICHAEL","Well give him a call.  Johnny, how are you?"],["JOHNNY","Hello, Mike -- nice to see you again."],["MICHAEL","We're all proud of you..."],["JOHNNY","Thanks, Mike."],["MICHAEL","Sit down, Johnny -- I want to talk to you.  The Don's proud of you, too, Johnny."],["JOHNNY","Well I uh, owe it all to him."],["MICHAEL","Well he knows how grateful you are. That's why -- he'd like to ask a favor of you..."],["JOHNNY","Mike, what can I do?"],["MICHAEL","The Corleone Family is thinking of giving up all its interests in the olive oil business -- settling out here.  Now Moe Greene will sell us his share of the casino and the hotel so it could be completely owned by the Family  Tom --"],["FREDO","Hey, Mike, are you sure about that? Moe loves the business -- he never said nothin' to me about selling..."],["MICHAEL","Yeah -- well I'll make him an offer he can't refuse.  See, Johnny -- see we figure that entertainment will be a big factor in drawing gamblers to the casino. And, we hope you'll sign a contract to appear five times a year.  Perhaps uh -- convince some of your friends in the movies to do the same. We're counting on you..."],["JOHNNY","Sure, Mike. I'll do anything for my Godfather -- you know that."],["MICHAEL","Good --"],["MOE","Hey, Mike! Hello, fellas -- everybody's here -- Freddy -- Tom. Good to see you, Mike..."],["MICHAEL","How are you, Moe?"],["MOE","All right -- you got everything you want? The chef cooked for you special -- the dancers will kick your tongue out, and your credit is good.  Draw chips for everybody in the room so they can play on the house."],["MICHAEL","My credit good enough to buy you out?"],["MOE","Buy me out?"],["MICHAEL","The casino -- the hotel. Corleone Family wants to buy you out."],["MOE","The Corleone Family wants to buy me out? No -- I buy you out, you don't buy me out --"],["MICHAEL","Your casino loses money -- maybe we can do better..."],["MOE","You think I'm skimmin' off the top, Mike?"],["MICHAEL","You're unlucky"],["MOE","You goddamn guineas really make me laugh -- I do you a favor and take Freddie in when you're having a bad time, and then you try to push me out!"],["MICHAEL","Wait a minute -- you took Freddie in because the Corleone Family bankrolled your casino -- because the Molinari Family on the Coast guaranteed his safety. Now -- we're talking business -- let's talk business..."],["MOE","Yeah -- let's talk business, Mike. First of all, you're all done. The Corleone Family don't even have that kind of muscle anymore. The Godfather's sick, right? You're getting chased out of New York by Barzini and the other Families -- What do you think is going on here? You think you can come to my hotel and take over? -- I talked to Barzini -- I can make a deal with him, and still keep my hotel!"],["MICHAEL","Is that why you slapped my brother around in public?"],["FREDO","Aw now that -- that was nothin', Mike. Now -- Now uh Moe didn't mean nothin' by that. Sure he flies off the handle once in a while, but Moe and me -- we're good friends, right Moe? Huh?"],["MOE","I gotta business to run. I gotta kick asses sometimes to make it run right. We had a little argument, Freddy and I, so I had to straighten him out..."],["MICHAEL","You straightened my brother out?"],["MOE","He was banging cocktail waitresses two at a time! Players couldn't get a drink at the table! What's wrong with you?"],["MICHAEL","I leave for New York tomorrow -- think about a price"],["MOE","Sonofabitch -- Do you know who I am? I'm Moe Greene! I made my bones when you were going out with cheerleaders!"],["FREDO","Wait a minute, Moe -- Moe, I got an idea --  Tom -- Tom, you're the Consiglieri and you can talk to the Don -- you can explain..."],["TOM","Just a minute now -- the Don is semi-retired and Mike is in charge of the Family business now. If you have anything to say, say it to Michael."],["FREDO","Mike! You don't come to Las Vegas and talk to a man like Moe Greene like that!"],["MICHAEL","Fredo -- you're my older brother, and I love you. But don't ever take sides with anyone against the Family again. Ever."],["CUT TO:","Corleone mall. Michael's limo drives through the gate with him, Kay, and Anthony. Anthony is sitting on Michael's lap. -day"],["MICHAEL","I have to see my father and his people, so have dinner without me..."],["KAY","Oh, Michael..."],["MICHAEL","This weekend we'll go out  We'll go to the city -- we'll see a show and we'll have dinner. I promise."],["KAY","Okay...  Oh, Michael -- Michael, your sister wants to ask you something..."],["MICHAEL","Well let her ask..."],["KAY","No -- she's afraid to. Connie and Carlo want you to be Godfather to their little boy."],["MICHAEL","Oh, well we'll see..."],["KAY","Will you?"],["MICHAEL","Lemme think about it -- we'll see. Come on --"],["DISSOLVE TO:","The Don's garden. The Don, older looking now, sits with Michael -day"],["VITO","So -- Barzini will move against you first. He'll set up a meeting with someone that you absolutely trust -- guaranteeing your safety. And at that meeting, you'll be assassinated.  I like to drink wine more than I used to -- anyway, I'm drinking more..."],["MICHAEL","It's good for you, Pop."],["VITO","I don't know -- your wife and children -- are you happy with them?"],["MICHAEL","Very happy..."],["VITO","That's good.  I hope you don't mind the way I -- I keep going over this Barzini business..."],["MICHAEL","No, not at all..."],["VITO","It's an old habit. I spent my life trying not to be careless -- women and children can be careless, but not men.  How's your boy?"],["MICHAEL","He's good --"],["VITO","You know he looks more like you every day."],["MICHAEL","He's smarter than I am. Three years old, he can read the funny papers"],["VITO","Read the funny papers --  Oh -- well -- eh, I want you to arrange to have a telephone man check all the calls that go in and out of here -- because..."],["MICHAEL","I did it already, Pop."],["VITO","-- ya'know, cuz it could be anyone..."],["MICHAEL","Pop, I took care of that."],["VITO","Oh, that's right -- I forgot."],["MICHAEL","What's the matter? What's bothering you?  I'll handle it. I told you I can handle it, I'll handle it."],["VITO","I knew that Santino was going to have to go through all this. And Fredo -- well --  -- Fredo was -- well -- But I never -- I never wanted this for you. I work my whole life, I don't apologize, to take care of my family. And I refused -- to be a fool -- dancing on the string, held by all those -- bigshots. I don't apologize -- that's my life -- but I thought that -- that when it was your time -- that -- that you would be the one to hold the strings. Senator - Corleone. Governor - Corleone, or something..."],["MICHAEL","Another pezzonovante..."],["VITO","Well -- this wasn't enough time, Michael. Wasn't enough time..."],["MICHAEL","We'll get there, Pop -- we'll get there..."],["VITO","Uh...  Now listen -- whoever comes to you with this Barzini meeting -- he's the traitor. Don't forget that."],["DISSOLVE TO:","The Don's tomato garden. The Don is with Michael's son, Anthony. -day"],["ANTHONY","Can I hold it, please?  Yeah, I will take care..."],["VITO","Come're -- come're -- come're"],["ANTHONY","Can I water these?"],["VITO","Yeah -- over here -- over here. Be careful, you're spilling it -- you're spilling it...  Anthony -- com'ere -- com'ere -- com'ere -- com'ere. There, that's right. We'll put it right there. Aie -- watch this -- come here. I'll show you something, come here. Now you stand there..."],["ANTHONY","Give me orange..."],["VITO","Oh no?  That's a new trick --  You run in there -- run in there..."],["ANTHONY","See -- where are you?  Get down!"],["ANTHONY","Uh - uh - uh - uh - uh - uh - uh - uh - uh - ouch!"],["DISSOLVE TO:","Cemetery. We hear church bells as a procession of cars drives in. Chauffeurs open car doors to let mourners out, including that old man who sang \"Luna Mezz'o Mare\" at Connie's wedding reception. Michael, Tom, Mama, Connie and others are sitting in chairs in front of the Don's flower-covered casket. They watch as mourners place single red roses on top. We see Johnny, Clemenza, and his wife toss roses. Barzini tosses a rose, and glances at Michael and nods. We see Tessio walking from Barzini, towards Michael. -day"],["TESSIO","Mike, could I have a minute?  Barzini wants to arrange a meeting. He says we can straighten any of our problems out..."],["MICHAEL","You talked to him?"],["TESSIO","Yeah -- I can arrange security. On my territory. Alright?"],["MICHAEL","Alright..."],["TESSIO","Alright."],["TOM","Do you know how they're gonna come at'cha?"],["MICHAEL","They're arranging a meeting in Brooklyn. Tessio's ground, where I'll be \"safe\""],["TOM","I always thought it would've been Clemenza, not Tessio..."],["MICHAEL","It's a smart move -- Tessio was always smarter. But I'm gonna wait -- after the baptism. I've decided to be Godfather to Connie's baby. And then I'll meet with Don Barzini -- and Tattaglia -- all of the heads of the Five Families..."],["CUT TO:","Full shot of the interior of the church. Organ music is heard, and the baby is crying."],["CUT TO:","Kay carries Carlo & Connie's baby toward the altar, followed my Michael."],["PRIEST","\"Let us pray...\""],["CUT TO:","Hotel room. Rocco is preparing his machine gun."],["CUT TO:","Clemenza walks to his car carrying a large package. He pauses to wipe his car."],["CUT TO:","Church. Priest dips his hand into oil jar, and sprinkle's the baby's lip and chin."],["PRIEST",""],["CUT TO:","Barbershop. Barber is patting lather on a Willie Cicci's face for a shave."],["CUT TO:","Hotel room. Neri takes his old policeman uniform out of a suitcase."],["CUT TO:","Church. Priest dips his hand in more oil, signs the cross on the baby's forehead."],["CUT TO:","Hotel room. Neri, dressed in uniform, dumps a bag containing badges and a gun."],["CUT TO:","Hotel. Clemenza, carrying his package, ascends the stairs."],["CUT TO:","Church. Priest makes the sign of the cross over the baby. The ceremony continues."],["PRIEST","Michael, do you believe in God, the Father Almighty -- Creator of Heaven and Earth?"],["MICHAEL","I do."],["CUT TO:","Building lobby. Barzini walking, stepping out a cigarette."],["PRIEST","Do you believe in Jesus Christ, His only Son our Lord?"],["MICHAEL","I do."],["PRIEST","Do you believe in the Holy Ghost -- the Holy Catholic Church?"],["MICHAEL","I do."],["CUT TO:","Courthouse. Barzini's car is parked. Neri motions to the chauffeur to move the car."],["CUT TO:","Hotel stairway. Clemenza continues to ascend the stairs with his package."],["CUT TO:","Hotel room. Rocco is greeted by a man who gets a gun. They descend steps."],["CUT TO:","Barbershop. Cicci exits."],["CUT TO:","Church. The ceremony continues."],["CUT TO:","Courthouse. Barzini and bodyguards descend the steps as Neri writes a ticket."],["CUT TO:","Hotel. Cicci is ascending the steps. Pauses to lean on railing as he smokes."],["CUT TO:","Clemenza makes it to the 5th floor elevator, and presses the button."],["CUT TO:","Massage room. Moe Greene is lying on his stomach getting a massage."],["CUT TO:","Church. The ceremony continues."],["PRIEST","Michael Francis Rizzi -- do you renounce Satan?"],["CUT TO:","Hotel elevator revealing Strachi, a Don, and the elevator operator. The door opens and Clemenza fires 2 shots."],["CUT TO:","Church."],["MICHAEL","I do renounce him."],["CUT TO:","Massage room. Gunman opens the door, Moe puts glasses on, gets shot in one eye."],["CUT TO:","Church."],["PRIEST","And all his works?"],["CUT TO:","Hotel. Cicci ascending steps. Then follows Don Cuneo into a revolving door, locks it, then shoots four times through the glass."],["CUT TO:","Church."],["MICHAEL","I do renounce them."],["CUT TO:","Motel room. Rocco kicks open the door and he and another gunman fire. The girl screams Oh God! Oh God! as she and Tattaglia are riddled by bullets while in bed."],["CUT TO:","Church."],["PRIEST","And all his pomps?"],["MICHAEL","I do renounce them."],["CUT TO:","Courthouse. Neri shoots Barzini's bodyguard twice, and his chauffeur once, as Barzini turns to run. Neri drops to one knee and carefully fires at Barzini, who topples after two shots. Neri gets picked up."],["CUT TO:","Church."],["PRIEST","Michael Rizzi -- will you be baptized?"],["MICHAEL","I will."],["PRIEST","In nomine Patri -- et Filii, --"],["CUT TO:","Motel room. Tattaglia's dead body on the bed."],["CUT TO:","Revolving door. Don Cuneo's dead body."],["PRIEST","-- et Spiritus Sancti"],["CUT TO:","Courthouse. Dead bodies of Barzini, bodyguard, and chauffeur"],["PRIEST","Michael Rizzi..."],["CUT TO:","Church. A candle is held before Michael"],["PRIEST","Go in peace, and may the Lord be with you. Amen."],["DISSOLVE TO:","Church exterior steps. The family is outside, congratulating Connie and Carlo. -day"],["MICHAEL","Kay..."],["CONNIE","Come on, kiss your Godfather..."],["MICHAEL","Carlo -- can't go to Vegas. Something's come up. Everybody's going to leave without us."],["CONNIE","Oh, Mike -- it's our first vacation together."],["CARLO","Hey Connie, please.  What do you want?"],["MICHAEL","Go back to the house -- wait for my call. It's important."],["CARLO","Alright."],["MICHAEL","I'll only be a couple of days..."],["MAMA","Statta bene -- statta bene"],["CUT TO:","The Don's kitchen. -day"],["TESSIO","We're on our way to Brooklyn  I hope Mike can get us a good deal tonight."],["TOM","I'm sure he will..."],["DISSOLVE TO:","Corleone gate. Tessio and Tom leave the house. Willie Cicci stops them. -day"],["CICCI","Sal -- Tom -- the Boss says he'll come in a separate car. He says for you two to go on ahead..."],["TESSIO","Hell, he can't do that -- it screws up all my arrangements!"],["CICCI","Well, that's what he said."],["TOM","I can't go either, Sal."],["TESSIO","Tell Mike it was only business. I always liked him."],["TOM","He understands that."],["CICCI","Excuse me, Sal..."],["TESSIO","Huh?  Tom -- can you get me off the hook? For Ol' Times' sake?"],["TOM","Can't do it, Sally."],["CUT TO:","Connie and Carlo's house. Tom, Michael, Neri and Rocco enter. Carlo hangs up the phone that he was dialing. -day"],["MICHAEL","You have to answer for Santino, Carlo."],["CARLO","Mike, you got it all wrong..."],["MICHAEL","You fingered Sonny for the Barzini people. Ahhh that little farce you played with my sister - - you think that could fool a Corleone?"],["CARLO","Mike, I'm innocent -- I swear on the kids, Mike -- Please, Mike, don't do this to me."],["MICHAEL","Sit down."],["CARLO","Mike, don't do this to me, please..."],["MICHAEL","Barzini's dead. So is Phillip Tattaglia -- Moe Greene -- Strachi -- Cuneo -- Today I settle all Family business, so don't tell me you're innocent, Carlo. Admit what you did.  Get him a drink.  Come on. Don't be afraid, Carlo -- Come on, you think I'd make my sister a widow? I'm Godfather to your son, Carlo --  Go ahead, drink it -- drink  No -- Carlo -- you're out of the Family business, that's your punishment. You're finished. I'm putting you on a plane to Vegas --  Tom?  I want you to stay there. Understand?  Only don't tell me you're innocent. Because it insults my intelligence -- and makes me very angry...  Now who approached you? Tattaglia or Barzini?"],["CARLO","It was Barzini"],["MICHAEL","Good.  There's a car waiting for you outside to take you to the airport. I'll call your wife, to tell her what flight you're on."],["CARLO","Mike, please..."],["MICHAEL","Come on -- get outta my sight."],["CUT TO:","Corleone gate. Buttonman is putting luggage into the rear of the car. Carlo gets into the front seat. -day"],["CUT TO:","Interior of car. Clemenza is seen behind Carlo, in the back seat. -day"],["CLEMENZA","Hello, Carlo..."],["CUT TO:","Carlo's house. Michael, Neri and Hagen emerge as Rocco locks the door. -day"],["CUT TO:","Interior of car. Clemenza garrotes Carlo, who gets pulled back and kicks his feet at the windshield, which breaks as the car takes off. Michael, Tom, and Rocco watch. After the car pulls away, we hear the Title Theme music as they walk through the mall. -day"],["DISSOLVE TO:","The Corleone mall. Moving men load a truck labeled \"John J. Bartek Moving.\" We see a sign on the wall that says \"Future Commercial Development - Genco Land Co. - 5.6 Acres\" with a small \"sold\" sign underneath it. A limousine drives through the gate stopping besides the moving truck. Connie gets out, arguing with her mother who's seated in the car. -day"],["CONNIE","Whattaya tryin' to tell me!"],["MAMA","Look -- I'm trying to tell you you're wrong!"],["CONNIE","Aw Mama, please!  Michael! Michael!"],["KAY","What is it?"],["CONNIE","Where is he? -- Michael!"],["CONNIE","Michael! You lousy bastard -- you killed my husband! You waited until Papa died so nobody could stop you, and then you killed him. You blamed him for Sonny -- you always did. Everybody did. But you never thought about me -- you never gave a damn about me. Now what am I going to do?"],["KAY","Connie..."],["CONNIE","Why do you think he kept Carlo at the mall? All the time he knew he was gonna kill'im.  And you stood Godfather to our baby -- you lousy cold-hearted bastard. Want to know how many men he had killed with Carlo? Read the papers -- read the papers!  That's your husband! That's your husband!"],["MICHAEL","Come on..."],["CONNIE","No! No! No!"],["MICHAEL","Get her upstairs. Get her a doctor."],["MICHAEL","She's hysterical -- hysterical."],["KAY","Michael, is it true?"],["MICHAEL","Don't ask me about my business, Kay..."],["KAY","Is it true?"],["MICHAEL","Don't ask me about my business..."],["KAY","No."],["MICHAEL","Enough!  Alright. This one time  -- this one time I'll let you ask me about my affairs..."],["KAY","Is it true? -- Is it?"],["MICHAEL","No."],["KAY","I guess we both need a drink, huh?"],["CLEMENZA","Don Corleone..."],["THE END",""]]